{
	"name": "Fey Pranks",
	"category": "Misc",
	"source": "https://www.reddit.com/r/d100/comments/8hxmlj/lets_build_fey_pranks/",
	"data": [
		{
			"name": "Prank",
			"data": [
				"Replacing a metal sword with a limp tree branch.",
				"Filling a canteen with mud.",
				"Draws moustaches on a random party member while they sleep.",
				"Adds a few rocks to a characters backpack every now and then so it gradually gets heavier and heavier.",
				"Sand in pants and pebbles in shoes.",
				"Leaves notes with target insults where the party will find them.",
				"Change all alcohol to water.",
				"Turn your hat into a frog.",
				"Fill your lantern with water.",
				"Cover bed rolls with honey.",
				"Switch every party members feet, giving them all a penalty to move speed and a saving throw against tripping.",
				"The classic creepy-crawlies in your shoes.",
				"All your weapons are covered by a thin, sticky sap that easily washes off with water.",
				"Charcoal doodles on your face.",
				"They cast Silence on you while you slept, so you wake up with a really sore throat.",
				"Your equipment is coated in oil, making it nearly impossible to hold onto.",
				"They made you pee yourself while you were asleep.",
				"You hear booming thunder in the middle of the night, waking you up. Surprise surprise, it’s not actually storming.",
				"A piece of parchment was glued to your back, just out of reach. It says something incredibly unflattering.",
				"They create the illusion of a dragon/tarrasque/purple wurm about to swallow you whole. Just before it reaches you, it disappears into mist.",
				"They REALLY messed up your hair.",
				"They heavily salted your rations while you slept.",
				"They painted your face to look like a cartoony animal.",
				"Change all water to alcohol.",
				"Follow a party member arround invisible, make illusory fart sounds.",
				"Reposition all trees in the area the party slept in into a weird pattern.",
				"Leaving an enchanted pile of gold out in the grass, with every coin permanently transforms into a marigold the next time it is exposed to sunlight after being stored away.",
				"Reversing the victims facial expressions, causing their face to express the opposite of whatever emotion they try show. Trying to frown results in a smile, an attempt at sneering ends up as a look of admiration, etc.",
				"Enchanting the victim to spew a swarm of angry bees from their mouth every time they open it. The bees immediately attack nearby creatures, the victim included. The enchantment ends as soon as the victim comes into contact with honey or at the next blue moon, whichever occurs sooner.",
				"A songbird starts to follow a party member around. The next time they roll a 1 on an attack or ability check, it flies overhead and poops on them.",
				"In the middle of the night, the party’s campfire throws off colorful sparks for 1d4 minutes.",
				"While walking through the wilderness, the party comes across footprints they recognize as their own tracks. The party isn’t wandering in circles, though; the prankster has simply copied or transplanted some footprints from earlier in their journey.",
				"Cut the tips off your arrows.",
				"Steal one of the party members’ voices.",
				"Dump water all over the sleeping party.",
				"Lure an alligator into one of their tents.",
				"Steal the last day of their memory.",
				"Add one more sleeping bag to their sleeping rotation. Do as much as possible to make it seem as though the party has an extra member that they just do not remember, complete with footprints leading off into the woods.",
				"Subtly change a character’s voice inflection so every comment sounds like innuendo.",
				"Make everything taste like raisins. Except raisins…",
				"A tune which you can’t quite place plays faintly in the distance. No one else can hear it.",
				"Swap two party members’ voices.",
				"Your reflection sticks its tongue out at you.",
				"Players with moustaches lose them, players without moustaches wake up with one.",
				"Each player wakes up with an extra limb or without one.",
				"You wake up on another continent.",
				"You are gifted a pouch of fairy dust that is actually just itching or sneezing powder.",
				"Whenever you speak, you bawk like a chicken. You cannot hear it as bawking. Anyone trying to explain to you that you’re bawking will register upon you as saying they can’t hear you and you need to talk louder.",
				"Shave half a beard or mustache.",
				"Put a fake spider/insect/monster in their sleeping bag. Or real ones.",
				"Woopie cushion under the horses saddle.",
				"Wrap all their gear in thick vines.",
				"Stuff moss into the toes of their boots so they think their shoes shrunk.",
				"Switch some of their coins for the chocolate covered variety.",
				"Make them think their sword or pet or hat can talk to them.",
				"The classic ‘kick me’ sign on their back.",
				"Freeze an item inside a block of ice.",
				"Hide something like fish guts somewhere in they won’t easily find and let it slowly rot and stink up everything.",
				"Hide a cricket in their gear somewhere, remind the players constantly of the chirrping.",
				"Wanted posters up everywhere with their faces on it. Bonus points if crime is something embarrassing.",
				"Poke holes in the bottom of their waterskin.",
				"Leaves an obviously magical stone in the middle of your camp. What it does is hidden from you. Any attempts to discover the magic make absolutely no sense. But it is definitely doing something. (Something like attracting snails to a place one mile away from it, something no reasonable player would ever have reason to figure out.)",
				"The entire camp is found floating 10 feet in the air. Even the campfire. Getting down is difficult.",
				"They all wake up with the same face for one hour.",
				"A player wakes up with a bloody, severed head in his sleeping bag. Once held it screams and bursts into a bunch of moths.",
				"The player sees the world in black and white for the rest of the day.",
				"The player sees the world in inverted colour for the rest of the day.",
				"The player wakes up on top of a tree, along with all their heavy gear, backpacks, knapsacks, and even sleeping bags and tent, if they have those. if they slept in a cart or something, that gets taken up too. Naturally, they’ll all fall out of the tree immediately.",
				"Someone turned all our armor bright pink!",
				"The player’s helmet smells heavily of cheese for the rest of the day.",
				"Someone cast Enlarge/Reduce on the player’s clothing. Needless to say, it no longer fits.",
				"Confetti everywhere! Or glitter. Or Faerie fire. Just something brightly coloured and with a tendency to get everywhere.",
				"All stealth gear (lockpicks, hidden daggers, etc) glows in the dark.",
				"The entire camp is now covered in faerie dragons who won’t leave the players alone. They make random comments all the time and are generally unhelpful and irritating. They go away after a few hours.",
				"The next time a weapon is drawn, POOF, it’s now a rubber chicken and pixie dust is everywhere. Squeezing it makes a dumb noise. It turns back after a few rounds.",
				"A Satyr follows a person playing theme music.",
				"Pixies cast a glamour spell on the ugliest person in the party. Suddenly that PC is a gorgeous female elf.",
				"A dryad wishes someone to stay and talk with them. She casts a root spell, if the PC stops for more than a min the PC feet start to root in place.",
				"A PC suddenly has a trail of small saplings following him where that PC goes.",
				"You are gifted a fire breathing chicken that lays spicy eggs.",
				"You are polymorphed into a chipmunk. It can only be broken by you receiving damage.",
				"Everyone in the party look like the same person. (it’s who the pixies think is ugliest)",
				"Every time a bag is opened it makes a fart sound.",
				"Bright lights appear as soon as someone says the word Stealth and won’t disappear until someone not in the party sees you.",
				"A rhinoceros is stampeding down the thin path. It’s a pretty obvious illusion without a shadow or footprints that passes through anyone harmlessly if they don’t move. Anyone that the illusion passes through now smells like a sweaty stinky rhinoceros.",
				"The party finds a fruit tree growing a variety of fruits and vegetables, even kinds that don’t grow on trees. They are perfectly fine to eat, but none of them taste how they look. (The banana tastes like potato, the broccoli tastes like orange, etc. )",
				"Everyone’s ears have been changed into donkey ears.",
				"One of the party finds themselves uncomfortable and unable to sleep thus losing the benefits of a long rest and instead becoming exhausted. A single pea placed under their bedroll is the cause. If planted, the pea will sprout into a magical beanstalk.",
				"One of the party (any gender) starts to feel increasingly bloated and nauseous over the course of three days. They are far more hungry and crave odd combinations of food. They wake up on the fourth day to find a large egg in bed with them as though they have laid it. The egg eventually hatches into a really ridiculous and ugly leggy bird that runs off laughing (or another creature of the GM’s discretion.)",
				"You happen across a traveling merchant offering excellent deals. All his goods and even his change are fake. (transformed sticks, leaves, dirt, old boots, etc.)",
				"The party is dumped into a hedge maze that cheats by re-arranging itself.",
				"Many small fairies are helping a gigantic elderly snail slowly cross the road. It will take an hour for it to cross. The fairies warn you not to leave the path in the mean time. Will-o’-wisps lurk on the borders as a warning. Anyone who does leave the path hoping to simply walk around the snail finds themselves instantly transported into a confusing and thorny hedge-maze that takes more than an hour to escape from.",
				"Your coins have been enchanted with magic mouths to tell bad puns. They insult your poverty, your social status, merchants, and any goods you are trying to buy.",
				"Everyone’s boots and shoes are now only left-footed. This fixes after 24 hours.",
				"Your team is followed around by a troop of squirrels. Whenever you say a certain, fairly common word, they bombard you with walnuts.",
				"Replace all of your arrow heads with red berries. (If first pulled out in battle the PC might not notice before firing one or two.)",
				"The afflicted player REALLY needs to sneeze, but can’t.",
				"The entire party gets the hiccups.",
				"The afflicted player feels uncomfortably warm, no matter the environment.",
				"The afflicted player has an itch in an unreachable part of their back. Whoever itches it is afflicted next.",
				"The PCs’ clothes become bound to their bodies and turn into dancing outfits. The PCs also lose the ability to speak and always dance when trying to move, battle or interact with something. Lasts one day.",
				"The PCs gain traits of various forest animals (deer antlers, squirrel tail, etc.)",
				"A random PC’s hands turn into bushes. Strange berries that grow on these bushes also apply that same effect when consumed.",
				"The skin and hair of the PCs now have unusual and bright coloring.",
				"The PCs are still completely aware, but their bodies are controlled by the pranker. She makes them do sinchronised dancing for 1 hour.",
				"A random PC’s hair becomes 10 times longer than before and stops being affected by gravity.",
				"A random PC starts to grow long, soft, brightly colored fur out of their neck and wrists.",
				"The PCs’ clothes turn into very expencive and beautiful outfits. The PCs also can only use very formal words in a conversation.",
				"The PCs are transformed into furniture and dishes needed for a tea party. They can still see and hear, but can’t willingly interact with the world in any way. The pranker and her friends appear out of nowhere to sit down, drink a cup of tea and gossip.",
				"The PCs and all their equipment appear black and white to everyone, including themselves.",
				"A random female PC gets an unremovable flower crown, but every flower in that crown is 3 times bigger than that PC’s head.",
				"The PCs are transformed into tiny pink dragons with glitter breath. The effect lasts for 2d4 hours.",
				"The pranker hosts a game show where the PCs are the players, and not getting your hands transformed into tree branches for 7 days is the main prize.",
				"Cast prestidigitation to make a black cloud float over someone’s head wherever they go. Including indoors."
			]
		}
	]
}