{
	"name": "Ghost Unfinished Business",
	"category": "Misc",
	"source": "https://www.reddit.com/r/d100/comments/85864p/lets_builda_ghosts_unfinished_business_x100/",
	"data": [
		{
			"name": "Unfinished Business",
			"data": [
				"Give regards/news to loved one.",
				"Find the killer.",
				"Kill the killer.",
				"Finish reading/writing a book/journal.",
				"See a child/mentee get married/graduate.",
				"Fix the error in the formula they were writing.",
				"See someone/something they were waiting for.",
				"Get a law changed.",
				"Harvest crops of a dilapidated farm.",
				"Finish an aria.",
				"Make amends.",
				"Figure out where they heard that music that was going through their head when they died.",
				"Overcome their fear of death.",
				"Realize they are actually dead (à la Sixth Sense).",
				"See the ocean one last time after dying in the middle of the desert.",
				"See land again after being trapped for centuries on a ghost ship.",
				"Finish climbing that damn mountain that killed them.",
				"Find that one last item that would have completed their (very esoteric) collection.",
				"Tell the person who killed them that they are forgiven.",
				"Say goodbye to their pet 🙁",
				"Make sure their lineage remains pure and the children are responsible with their inheritance.",
				"See how the village is doing.",
				"See all of their family.",
				"Find that stupid treasure they have been venturing for all of their life.",
				"They were listening to a beautiful song when they died, they need to hear how it ends.",
				"Possess a commoner for one last bout of carousing (maybe a PC?).",
				"Preserve their tattoos, possibly through some very gross taxidermy (They tell a very important story).",
				"Find what was at that damn spot marked out on the old map they found.",
				"Tell their kid not to follow in their footsteps.",
				"Return a stolen good to its original owner.",
				"Have a treasured possession buried with their corpse.",
				"Dead chef ghost, cannot rest until he proves his signature dish is better than his still living rivals dish.",
				"Can’t remember if they’ve left the oven on or not.",
				"To reconcile their taxes.",
				"Guide them up from the underdark to the surface to see the sun one last time.",
				"Show them that their family / bloodline was not, as they believe, wiped out, by bringing them to observe their descendants.",
				"(Evil ghost) Show them that their reign of terror in life is all but forgotten–that they have not been remembered–by bringing them to the cheerful village that they terrorized in life.",
				"They always paid respects to their grandmother on the anniversary of her death, never missed a year until they died. They need to pay their respects one last time.",
				"Their children didn’t pay respects to their grave this year, or the year before. If their children honor their grave one last time, they can pass on.",
				"Find their corpse (and therefore discover their cause of death).",
				"Pass on the code words to enter their secret society.",
				"Remember their own name.",
				"Fulfill their lifelong goal of opening a quaint little bakery, flower shop or barber.",
				"Get their buddy laid.",
				"Have their funeral rites read and their body laid to rest.",
				"See the sunrise one last time, yet is only on the material plane during the night.",
				"Say a final goodbye to family/spouse.",
				"To finish the last menial task they had to do.",
				"To help their loved one on their adventures.",
				"To confess their love for someone they were too afraid to tell while alive.",
				"Find the answer to a complex riddle/puzzle.",
				"Repair a broken weapon that is part of their family lineage.",
				"Find where they buried their life savings and bequeath it to their loved ones.",
				"Make sure their family is moved to a better settlement with greater opportunities.",
				"Murder their former spouse.",
				"Find their missing child whom they were already looking for when they died.",
				"Have proper funeral rites read from a priest of their chosen religion.",
				"Their town was infested by (insert monster) and needs to be cleansed for them to move on.",
				"Be acknowledged for their accomplishments by someone of great import.",
				"Willingly receive a proper exorcism.",
				"Finish their script for a play they wrote.",
				"Feel someones intimate embrace once more through a willing participant’s possession.",
				"Change someone’s mind about a controversial topic.",
				"Have their own mind changed about a controversial topic.",
				"Recover the sword of Life Stealing that took his father’s life. It was last seen on a tiefling barbarian.",
				"To find the purchase agreement of the family farm. It was sold illegally as part of Magistrate Vorkain’s rise to power.",
				"To take one more breath of air (don’t we all?).",
				"Agnor roams the streets of the city in search of the descendants of Bilgurym, the thief that killed him over his coin purse. Agnor won’t rest until every descendant of Bilgurym is slain. Bilgurym was slain 500 years prior and yet Agnor still roams the foggy streets of the city.",
				"Ghost of famed pirate. Won’t rest until his illegitimate boy is made a cabin boy on board a pirate ship.",
				"Artur Deghnd was killed because of mistaken identity. He now wants his name cleared and Artur Dehnt properly punished.",
				"Werarod of Cretten is the son of a local lord. Werarod became infatuated with a local peasant girl named Elyss. When she spurned him, he took her by force. When he realized his actions, he took his own life. Now he cannot rest until Elyss is happily married.",
				"Drivia henpecked her husband until her death from wasting disease. She can’t rest until her husband ‘makes something of himself’.",
				"A pianist cut his own hands off to escape an abandoned dungeon, his keepers having long since fled. He didnt get far but he regreted every moment he spent without his dextrous, spindly hands. The ghosts asks that you find his rotting hands within the dungeon and bring them back to him. Bonus: the ghost will settle for any pair of hands you give him.",
				"Rid the world of a magical item that is not easily destroyed.",
				"Escort their spirit across the Astral Plane to lay their soul to rest.",
				"A pirate captain was burying his treasure when he happened upon a lovely Nymph. He sought her out each month and soon they both fell in love. He was already betrothed, but this was an arranged marriage and he wasn’t happy. The Nymph and captain were to wed in secret when the jilted fiance shows up in a fiery flash. She cursed the cheating fiance to forever sail the seas and to never step foot on dry land. To the Nymph, she cursed her to become a wooden figurehead. The clause of the curse was this: True love would never be found as long as the white sands fall down. The captain piloted the ‘Cursed Heart’ ship and when he died, became a sorrowful ghost. Somewhere on another ship, the nymph comes alive only for one hour a night on a full moon. The cursed heart will always attack the Sea Nymph in order to take the wooden figurehead. The sorceress (jilted fiance) guarded the never-ending hourglass at the top of her tower. When she died, she became a Banshee guarding the last thing she loved… the curse.",
				"Bring their bones to their ancestor’s tomb.",
				"A young child was lost in a forest. His father searched desperately for him, but could never find him. He angrily began chopping down the forest, looking for his son. Now dead, his ghost will not rest until the entire forest is chopped down or burned to ash.",
				"A royal ghost won’t rest until their rightful heir sits upon the throne.",
				"A child lost in the winter passed away from the cold. They can’t move on until they are reunited with their parents, but they were lost decades ago and don’t remember who their parents are.",
				"A soldiers ghost can’t move on until the war is over and his side is at peace.",
				"A wandering ghost won’t be able to move on alone. They await another lost soul with which they can depart the world together.",
				"Wants their body/bones burned and the ashes thrown into the air from the highest peak of the world.",
				"They want to create a weapon worthy of a name.",
				"They want to make contact with a greater deity to learn where their soul will be sent. Regardless of the answer, they move on whether they want to or not.",
				"They want to possesses a very powerful creature/person.",
				"This ghost had no reflection and wants to see their face as it is now.",
				"The ghost had started a religion based on a newly discovered deity. They want a church built and a small following of said religion.",
				"They had died in the most heinous way. They will not rest until they see someone die in a worse way.",
				"They never left their hometown in life. They want to see the rest of the world.",
				"They never defeated their rival family. They cannot rest until that family lineage is completely erased from the world.",
				"They lost their sight at a young age. They want to see the beauty of the world again.",
				"A powerful wizard died after losing their spellbook. It had many powerful spells and if it were to fall into the wrong hands it could be terrible. They want you to find and destroy it.",
				"A ghost of a shunned race has never been accepted in the city/kingdom they grew up in. They want the cities leader to recognize them and their kind as full fledged citizens.",
				"A ghost is now stuck in this miserable afterlife for their greediness. They need to give away their vast amount of riches to charity in order to move on.",
				"Finish a masterpiece work of art.",
				"Finish crafting a magical contraption.",
				"Finish the conversation they were having before they died.",
				"Killing themselves never took. They need to figure out a way to destroy their soul as well.",
				"They were creating a brand new board game/card game/table-top game. They need a group to test it out and make it a final product."
			]
		}
	]
}