{
	"name": "Unique Potion Containers",
	"category": "Items",
	"source": "https://www.reddit.com/r/d100/comments/99yx59/lets_build_interesting_potion_containers/",
	"data": [
		{
			"name":"Container",
			"data": [
				"A sealed gourd.",
				"A drinking horn.",
				"A sealed leather pouch, like a cross between a wine skin and a caprison.",
				"A section of bamboo.",
				"A paralyzed living giant firefly with a bloated potion filled light-up-part that you must squeeze the potion out of.",
				"Pint sized clay jug.",
				"A sealed stein/tankard",
				"A (literally) pint-sized portable hole",
				"A coconut sealed with a cork.",
				"A wineskin made from a cow’s udder so that four people can drink at once.",
				"A hollow sword hilt.",
				"A viking-style horned helmet, except both horns are hollow and you can use small bamboo straws to drink from them.",
				"A realistic-looking artificial hand which is actually hollow; the thumb is the removable stopper.",
				"A very large, leathery leaf, carefully wrapped and tied to preserve the thick liquid within.",
				"The upper half of a skull (obviously this one can’t be sealed but could still hold liquid).",
				"A long, thin leather bladder with straps specifically designed to be concealed in the sleeve of a cloak and tied to the forearm.",
				"A syringe.",
				"A leather boot that looks like it could fit a human child, but upon closer inspection the boot would have been far too wide for any human foot. A large, cork stopper is where an ankle would have been.",
				"Wine skin / water skin.",
				"Glass flask.",
				"Metal flask.",
				"Tiny metal flask built into a pendant.",
				"A small box enchanted to freeze anything inside it. Potions are frozen into icy popsicles.",
				"Fruit that has been soaked in potion until it takes on properties of the potion. Squeeze the juice out to get the potion.",
				"Mason jar.",
				"Wax tube filled with potion & then sealed with more wax, kept in a wooden box to keep them from breaking.",
				"Honey comb filled with potion & then sealed with bee’s wax.",
				"The hilt of a magic sword.",
				"A sealed glove so five people can drink at once.",
				"A watch where the face opens up.",
				"A flask that looks like a tie.",
				"A hollowed out crystal.",
				"A completely invisible, nigh-unbreakable flask, stoppered with an ordinary cork. Think a floating sphere of fluid suspended from a cork.",
				"The hollowed out canine tooth of a wyvern, with a cloth circle edged with bone acting as its lid.",
				"A small and delicate urn made from fired clay. Beautiful artwork covers the surface, and multiple handles jut out from the sides.",
				"A sealed steel canister with a button on its bottom. By twisting and pulling the button, an inactive rune of purification activates and transforms any liquids among the container’s contents into nonmagical water.",
				"A Sock of Resist Moistening. Though it looks and feels like an ordinary sock, the liquid contained within doesn’t seem to soak through.",
				"An elegant scroll case covered in ancient script that looks magical, but to the trained eye just describes how disappointed the creator was with how the case turned out.",
				"A jar of small, colorful candies, filled with potion beneath each candy shell.",
				"A carved wooden fish with its mouth gripping onto a smaller squid shaped cork.",
				"A conch shell.",
				"The fingerbone of an ogre.",
				"An enchanted vial that follows you around.",
				"A perfume bottle/atomizer to spray the potion as a fine mist.",
				"A glass ball with no opening that must be shattered to release the liquid within.",
				"The swollen translucent abdomen of a living wasp-like insect—can be stored with other potions of its kind in a specialized wasp nest. (okay, now I see there’s already an insect on the list.)",
				"The potion is reduced to a solid and emulsified into a powdered cube. Requires the addition of water to reconstitute, or dropped into a drink, or simply swallowed.",
				"A metal cylinder with indecipherable runes running along the side. It has a tab on the top to pop open and the contents are always fizzy.",
				"A fruit juice box.",
				"A belt of rope holding giant screw-shape seashells stoppered with sealant to stop spillage.",
				"A large tulips-like flower, its tips stitched with a fine thread, the petals surprisingly hardy.",
				"A miniature cloud that can be stored in a bag or will otherwise follow its owner around.",
				"Some kind of coral-like sea creature who when sung to will bloom sponges containing the potion. Can be restored with the right know-how to recreate the potion.",
				"A sturdy pod that needs to be bit into, bitter to the taste.",
				"A teapot, short and stout. Possibly a child reciting a nursery rhyme.",
				"An elaborate metal samovar, designed to keep the liquid at its ideal temperature. Has a tap and key dispenser and can be hung on the back of an adventurer’s pack.",
				"Someone repurposed the tip of a giant scorpion’s tail, hollowing it out and hacking off the stinger’s tip to use it as a makeshift gourd. That said, the tip could still probably be used as a type of injector if need be…",
				"A hollow glass bracelet with a nozzle, easy for quick combat use, not so easy to fill, but very handy nevertheless. Need a quick heal? It’s right there on your left wrist, have a sip!",
				"A bronze, presumably Dwarvish, gyroscopic bowl. It’s very strange how, with minimal magic, something could be devised that wouldn’t let its contents spill, even without a proper lid! Still, it remains easy to drink from. Simply stop the middle axle from moving and drink away… science these days, am I right?",
				"An elaborate steampunk-esque gauntlet with several trigger-activated self injectors. Not too sure what they could be useful for, but perhaps someone skilled enough with mechanics could flip it to inject other things without breaking the interesting piece of work…",
				"It looks like a feline skull, but it’s actually just a hollow wooden carving. It has a hole in the top for liquid consumption, and it has a lid so it can be emptied and refilled. The inside is prone to staining, but at least the outside maintains a whitish stained color.",
				"There absolutely had to be some sort of druidcraft at play here. No normal bonsai tree would grow hollow, nor would it grow with a resealable top, right? It’s too convenient.",
				"Meant to be quick and single-use items, these little orbs of thin glass-like material contain quick dosages, essentially shots of potions. Pop one in the mouth, bite down, spit the shell, move on.",
				"These little bags are made from banana leaves stitched together with spider silk, and contain potent poultices. All you need to do is tear the bag open and apply the contents to the skin, then let them work their herbal magic~!",
				"A “shake-and-go” bottle, a somewhat normal looking potion bottle with a small capsule on the inside containing other materials. When shaken, the capsule tears, allowing the inner materials to mix with the liquid inside. Perfect for inhalant mixtures, or things that just don’t quite work the same if you get them pre-made.",
				"It looks like a child’s toy, a simple stuffed animal. However, the clip on the back says otherwise. Open the teddy bear up to reveal a hidden metal cylinder with holes in it. Shake the bear or move it with enough force, and whatever is inside will mix and spit gas everywhere… Sinister…",
				"A wooden jar, with a small lid. The lid is held down with a leather strap.",
				"An ornate iron flagon, inscribed with a promise to whoever drinks from it.",
				"A hollowed out hilt for a sword, where the pommel acts as a stopper.",
				"A leather waterskin from an animal you don’t recognise.",
				"A snapped bone from a humanoid, which has been re-purposed into an odd vial.",
				"A palm-sized oak barrel attached to a short length of thin rope in such a way that it can be worn as a necklace.",
				"A glass vial that seems to be filled by a black oily liquid, upon uncorking and looking inside the liquid appears red.",
				"A beautifully carved red gem on the end of a mages stave, clearly used as a spellcasting focus. This gem is hollow glass filled with a healing potion, which must be broken to use.",
				"A rodent preserved through taxidermy, its insides hollowed and cleaned with its mouth acting as the opening. all other orifices are stitched up.",
				"A seemingly unblemished egg.",
				"A cigar with a label bearing the symbol of the god of life.",
				"An inhaler. (Similar to jet from Fallout)",
				"A beer bottle resealed with a cork and with rope tied around the top in order to make it easier to carry, or attach to beasts of burden",
				"Eye drops. (Similar to bloody eye in Cowboy Bebop)",
				"Bandages with a healing salve prepared inside.",
				"A bundle of incense that when broken create a sweet scent that can heal wounds.",
				"A paper tube with a fine, snortable powder inside.",
				"A tiny statue holding a potion bottle that when brought to your mouth pours the potion inside.",
				"Hard candies wrapped individually like butterscotch.",
				"Soft, waxy, chewy candy that has a potion in the center similar to gushers.",
				"An single use iron brand (like a car cigarette lighter) that feels warm and tingly to the touch",
				"Small pills that look to have been ground and crushed by hand.",
				"A seemingly simple silver hip flask. It actually functions as multiple flasks of holding, each containing a different potion, with access determined by how one opens it. Unscrew the cap to the left, one potion. Unscrew to the right, another potion. Pull straight out, a third. Etc. Unfortunately, the flask is unmarked, and resists all efforts to mark it with directions.",
				"A tiny wooden leg for a three legged dog. The paw can be unstoppered.",
				"A club, ugly, restrained with iron bands. Has a cork in the top.",
				"A large edible gelatin ball you could bite into.",
				"A bread bowl with a cap.",
				"A large snail shell filled with liquid.",
				"A water balloon, but filled with a potion.",
				"A hollowed out piece of rock salt.",
				"A blown glass bottle that used a dragon’s fire as it’s furnace.",
				"A hollowed out wooden figure of a dwarf.",
				"A coconut, which must be smashed to get the potion out.",
				"A glass vial in the shape of a beholder. You drink out of one of the eye-stalks."
			]
		}
	]
}
