{
	"name": "Cave Graffiti",
	"category": "Misc",
	"source": "https://www.reddit.com/r/d100/comments/9v2kby/lets_build_dungeon_graffiti/",
	"data": [
		{
			"name": "Graffiti",
			"data": [
				"‘Here Lies Big Benson – Didn’t Bring His Ten Foot Pole And Paid The Price’",
				"‘For a good time teleport to sequence [SIGIL SEQUENCE]’",
				"‘Sneek Atak Heer’ with an arrow pointing behind a rock.",
				"‘Kobold Pride’ in draconic.",
				"‘Your Mother Is A Succubus’",
				"‘Here lies Tom – ‘There’s no way that door can be a mimic’.’",
				"‘Here may be found the last words of Joseph of Aramathia. He who is valiant and pure of spirit may find the holy grail in the Castle of Aaauuuggghhh… ‘",
				"‘Dwarves Suck’ written 8 feet up a wall.",
				"‘Don’t bother trying to grave rob. The corpses don’t like visitors. Come to think of it, they don’t like anything living at all’.",
				"On the ceiling, ‘Beware of Trappers’. And on the floor, ‘Beware of Piercers’",
				"‘Archmage Drachnar and his Meat-Shields were here’",
				"On the side of the passage, ‘Only the penitent man shall pass …’",
				"A map of the dungeon that at first glance seems correct, but either upon closer inspection or actually trying to use it flaws are revealed, secret doors marked where there isn’t one, hallways/staircases connecting the wrong rooms, etc.",
				"‘I’ll make yer skeleton exit yer meat’, in Orcish.",
				"‘Do not open.’ on a door (door opens to a small, empty closet). ‘Can you not read?’ on closet wall.",
				"‘Don’t Dead, Open inside’ written in the same manner as on the show. While there’s probably undead on the other side, the more or less garentees the room hasnt been looted.",
				"‘You don’t matter! Give up!’ Placed on a pair of small signs outside of the dungeon. Left by a well intentioned, if a bit stupid, bard.",
				"‘Sorry about your wall!’ Place this one near either some blood from a prior battle or a hole in the wall for added effect.",
				"‘Fuck you!’ placed behind a false door with a booby trap rigged to the door. Maybe a explosive/grenade/fire trap or a rockfall trap.",
				"‘Sharg’s wife is most beautiful,’ in orcish script, next to a crude picture of a fang-mawed dog.",
				"A crude drawing of a kobold ‘in congress’ with a dragon. It isn’t clear from the context and art quality whether this is a good or bad thing for the kobold.",
				"68 tally marks scratched with incredible neatness. The last one looks very fresh and is shorter than the others…",
				"‘2 to the left, 3 to the right and straight below’ in the language of a subservient race to the main dungeon dwelling race.",
				"‘[Cheif’s right hand lackeys name] is [impotent/illiterate/part-human/vegetarian/a bookworm/short-sighted/other dire embarrasing trait for one of their species or job] ‘ this is a horrible rumour around the dungeon which (s)he has worked hard to stamp out and is now largely forgotton or at least unspoken. It is also 100% true. Make sure you introduce them by name when the PCs meet them!",
				"‘Trouble reading this? Try Lothar’s Lights for all your torch and lantern needs. Just a short ride from this dungeon.’",
				"‘That last bit of graffiti was written by a [setting appropriate expletive]ing liar’. On a successful spot check, evidence of dried blood can be seen on the floor below the graffiti.",
				"Originally a crude carving of a penis, someone painted over it to turn it into a kitten. If the paint is removed, the original carved design remains.",
				"‘Block the path RUN’",
				"‘Take off that hat.’",
				"‘It sees NO EYES’",
				"‘You have to burn the rope.’",
				"‘It hurts.’",
				"‘OVER THINKING IT’",
				"‘REDRUM’",
				"‘NILBOG’",
				"‘See you next Wednesday.’",
				"‘There is no such thing as Majestic-12.’",
				"‘How’s my dungeoneering?’",
				"‘Welcome to Hell. We accept payment in paper or plastic.’",
				"‘I must not tell lies.’",
				"‘Wash your boots, don’t leave any footprints behind.’",
				"‘I am so grateful to be alive. I am in a world of shit, yes, but I am alive. And I am not afraid.’",
				"‘She’s lying to you.’",
				"‘Did I ever tell you the definition of insanity?’",
				"‘Let me in. I’m scared.’",
				"In tiny lettering: ‘If you can read this, it’s already too late.’",
				"‘The Minotaur is not what he seems.’",
				"‘Secret door here.’",
				"‘Joreth – I’ve gone back for her. Meet me at the Frog and Jester in Pennyworth Lane.’",
				"‘Look behind you. Now!’",
				"‘I am the last of us. Do not think ill of me but I cannot go on alone. Do not choose the black door if you wish to see sunlight again. Good luck.’",
				"‘Ph’nglui mglw’nafh Cthulhu R’lyeh wgah’nagl fhtagn’",
				"‘No hope for those who proceed forward’",
				"‘Watch for the pit trap’",
				"In scribbled writing: ‘Don’t eat the mushrooms’",
				"Turn ‘wright’ at the fork’",
				"In blood: ‘Zed’s dead’",
				"‘100 gold to anyone who finds my sword – [insert name and location of npc]’",
				"‘Brother, She’s not here- she is apparently in another dungeon.’",
				"‘You’re lucky someone already read these Explosive Runes.’",
				"‘Here lies Gilbert – ‘The mushrooms clearly aren’t poisonous, that rat just ate some and it was fine. Look, I’ll show you.’",
				"‘The skeletons are not dead’ hastily written halfway down a hallway of skeletons.",
				"‘The Great Necromage Vilicous and his coterie of foolishly moral companions were here’",
				"‘Treat the dungeon with courtesy, and it will do the same’",
				"‘Worm Path – Look both ways before crossing’ chalked on the floor on both sides of a large, circular tunnel intersecting a hall.",
				"‘Mind the gaps’ written in large letters before an otherwise empty stretch of hallway.",
				"‘If you are reading this, do NOT look behind you until you exit the room’ scrawled in shaky letters on the back wall of a dead end room.",
				"‘Please step on me’ carved onto the surface of random rocks and tiles on the dungeon floor. The words are seen multiple times throughout the dungeon’s exploration, and seem to disappear when no one is looking. The words constantly reappear no matter what, but if stepped on, helpful and relevant graffiti is found before the next encounter, puzzle, or junction of pathways.",
				"‘Grall Stonebringer was here.’",
				"A picture of a gelatinous cube eating a person.",
				"A cartoonish picture of a dwarf running away from a rust monster.",
				"Written in very tiny letters: ‘If you can read this, you can’t see the goblin sneaking up behind you.’",
				"There is a short and narrow room; the long-rotted remains of a door hang off hinges at the entrance. Scrawled along one wall, in an ancient language the party must translate is ‘[Name of some long-dead king] gobbles donkey goobers’. The opposite wall is also marked, with ‘[Name of long-dead queen] does the nasty.’ If the party succeeds on a perception check they realize they’re standing in a toilet stall.",
				"A scribbled map of the dungeon, with a big X in one room and directions to a treasure. But it’s a trick; when the party stands at that spot they trigger a trap.",
				"‘Abandon hope all ye who enter here.’",
				"‘Artival. Waited 3 days for you. Ran out of supplies. Moving on to the next level (or whatever floor is the one below.’",
				"‘There’s a safe room in the center. Left food and supplies.’ (an obvious trap)",
				"‘On this day, Brumr Goldbeard killed ninety-three kobolds.’",
				"‘Who built this place?’",
				"‘Vampires don’t care about daylight when live indoors.’",
				"‘Stick to the center halls. They’re safer.’",
				"‘Tika isn’t dead. She’s with us.’",
				"‘WHERE IS THE EXIT’",
				"‘None are so blind that they cannot see the darkness of this place. Look not upon the face of the weeping one, Tread not on the bones of mad men.’",
				"‘We are the real monsters.’",
				"‘This corner secured by the Mighty Woodchucks.’",
				"‘This was all already written. You are being controlled. They know what you’re doing. We’re all just pawns in their little game. They decide who lives and who dies. None of us are safe. None of us have free will. Don’t let them win.’",
				"‘Jessedo R.I.P.’",
				"‘If you find my body, tell Matin I loved him.’",
				"‘God bless the Zentarim.’",
				"‘Here rests two good men — Nissus and Camom. Respect their souls.’",
				"‘Let it be known that I, Luip Salazom, screwed every barmaid in Neverwinter.’",
				"Drawings of butts, each one from a different race.",
				"A symbol in thieves cant that means it is safe to rest, with ‘r rouge died so I cant right this in yur theves speak, but go fuck yurself with a rusted spyke dipshit.’ painted over it.",
				"‘There is a secret door somewhere on this passageway- I hope you have better luck finding it.’",
				"Large scrawled lettering that says ‘Droop woz heer’",
				"Crimson red letters that are still oddly sticky, ‘Don’t ask about the price’",
				"An oddly phallic image that seems to have been painted on in bold white paint.",
				"Bloody scrawled writing say ‘The secret chamber has been opened.’"
			]
		}
	]
}