{
	"name": "Road Encounters",
	"category": "Encounters",
	"source": "https://nerdsonearth.com/2016/02/100-dungeons-and-dragons-roadside-encounters-2/, https://docs.google.com/document/d/1jdX3brX1hQ-r2SSbzJHGpag1MTOPg7MCV3mdcRsIg_c/edit, https://www.reddit.com/r/d100/comments/9pn0ov/d100_encounters_along_a_lonesome_road/",
	"data": [
		{
			"name": "Road Encounter",
			"data": [
				"Funeral procession complete with priests/clerics",
				"Noble in carriage with guards",
				"Recently wounded folks with tales of bandits that have stolen their stuff",
				"Armed people just taking a break (might look like bandits. Good to use on bridges).",
				"A brass dragon that really wants to talk to you and will bury you in the ground if you try to leave (see sleep gas)",
				"Bard singing stories. Asks party if they have any stories for him.",
				"Pottery merchant.",
				"Jeweler traveling with wares and guards",
				"A tipped over wagon with goods and people missing",
				"Old senile wo/man on the side of the road",
				"A troop of Halflings heading to their new home",
				"A cleric/priest preaching the end of days who tries to get the party to confess their sins and repent!",
				"Messenger galloping down the road on a horse shouting \"make way, make way!\"",
				"A hedge knight and their squire",
				"Soldiers in formation lead by a knight marching down the road.",
				"Traveling merchant selling perfumes, balms, ointments, oils, and healing potions.",
				"A set of cowboys herding their cows",
				"Mule drawn wagon with dwarven traders carrying stone and metal goods for trade. Armed with breastplates and warhammers.",
				"Wagon travelers stopped on the side of the road making food and resting.",
				"A pair of hunter bringing home their kill which hangs from a pole between them. (Deer, boar, squirrels, rabbits, pheasants, etc)",
				"Blood in the ground. The scene of a recent battle, but with not people or bodies.",
				"A body hung from a tree with a sign on it warning passers by (from local government to keep bandits in line OR from bandits to keep locals in line)",
				"A pre-wedding party drinking and traveling on their way to the ceremony.",
				"A furtive person offering to sell the party narcotics",
				"A parent teaching their offspring to ride a horse.",
				"Beggars",
				"People competing in a footrace between towns",
				"A dual between two fighters.",
				"A lone escaped cow.",
				"Traveling Circus",
				"Lost, crying children",
				"A dead warrior, propped up against a tree. His foe dead before him. ",
				"A slave merchant with guards and slaves in tow",
				"An exotic animal trader looking to buy or sell. Has guards and exotic wild animals",
				"An evangelical cleric preaching the good word of Martha / Astair (or other good / lawful gods)",
				"Traveling wizard on waggon pulled by donkeys",
				"Group of pilgrims",
				"Gnomes with a partially disassembled waggon arguing over the proper way to fix it.",
				"An amorous couple off the road whose sounds of enjoyment can be heard",
				"Prospectors",
				"Silent monks / nuns",
				"Another group of adventurers peacefully walking down the road",
				"A prisoner being escorted by a knight / armed man",
				"A naked man who has gambled away his clothes. Surprisingly well spoken.",
				"A leper ",
				"Someone who dropped a wedding ring and is scouring the road for it.",
				"Soldiers of local government asking people to pay an actual toll (not bandits!). Have a man in shackles next to them.",
				"Traveling blind man with a scimitar.",
				"Single female elf walking alone",
				"Traveling glass blower with guards",
				"Beekeeper resting on the side of the road with his bee boxes in a cart.",
				"Person / People re building a small bridge over a creek / stream",
				"Traveling alchemist from far far away",
				"A hunter who asks you to be quiet because \"it’s close\"",
				"Traveling magician",
				"Tax collector moving down the road with their enforcers ",
				"Person gone mad with the heat frantically digging a hole in the middle of the road.",
				"Insane person begging for punishment",
				"Local teenagers high as a kite on mushrooms / drugs / alcohol",
				"Berry pickers",
				"Gambling stall",
				"Fallen tree blocking the road, but no ambush.",
				"Traveling cheese vendor",
				"Rehearsing dancers/actors in a field getting it right before they show up in town.",
				"Bounty hunter armed to the teeth. Asks the party if they’ve seen who s/he’s looking for. Has a really bad sketch of their target.",
				"Traveling fortune teller",
				"Nobles out on a fox hunting party",
				"Runaway slave",
				"Mail carrier & single escort",
				"Traffic jam of waggons trying to get past a block in the road",
				"Dead courier",
				"Survivor(s) from a caravan attack",
				"Traveling diplomat and armed escort",
				"Tea house with people resting",
				"A waterhole",
				"Traveling wine merchant",
				"A painter drawing a lovely landscape",
				"Priests/Clerics preaching against dwarves (or other subrace)",
				"Lonely traveler who joins the party and walks along with them",
				"Roadside tavern",
				"A festival set up off the road with merchant stalls, music, dancing, art, drinking, etc.",
				"Someone who recognizes the party and is a fan of their work! Wants to hear their stories.",
				"Military patrol that asks if the party has seen anything unusual.",
				"Lone paladin cleansing the land of evil",
				"Someone selling jewelry at a heavy discount on the side of the road. A thief fencing his stolen goods.",
				"Roadside altar / temple",
				"Peasants moving grain by the wagon load",
				"Peasants moving fruits / veggies",
				"Traveling foreigner who doesn’t speak the language asking for directions to town. (Subrace that doesn’t speak common? Gnome / Halfling?)",
				"Horse with a saddle but no rider",
				"A man burying some bodies on the side of the road / old graves on the side of the road.",
				"Roadside brothel (has bouncers)",
				"Bones littering the ground off the road. The site of a battle from ages ago.",
				"Sudden rainstorm the party must take shelter from",
				"People napping on the side of the road.",
				"Herd of animals wandering about without an owner. Cows/sheep/goats/pigs.",
				"Tarred and feathered person",
				"A person stuck in a pit trap on the road.",
				"Deserters from some armed force. They are well armed but dejected and keep to themselves. ",
				"Mercenary group that’s recently been hired and moving on to their new job.",
				"A huge nest has fallen from a tree on the side of the road. The strange-looking eggs within seem on the verge of hatching.",
				"A dwarf falls from the sky onto the road with a splat. (Did a creature drop it, was he launched into the air, did he fall from a floating fortress?)",
				"A row of severed heads on spikes and a warning sign claiming, \"Dis Rode Belong To Negan\"",
				"A very small goblin wearing an old carpet as a cape leaps into the path and demands tribute.",
				"A crazed halfling, starved out of his mind, jumps to the backs of the PCs and rips their packs apart with his teeth in search of food.",
				"A bounty hunter tracks his target.",
				"A lush garden is filled with ripe vegetables. It is protected by a magical ward, but what is triggered when entering the garden?",
				"A monstrous mount is ridden by a gnome. Friend or foe?",
				"Two guards hold a wanted poster. They carefully studies the party as they pass by.",
				"A smiling roadside merchant roasts rats, frogs, and squirrels on sticks. He offers a bite to the PCs.",
				"A chatty bard walks alongside the party. Time for an exposition dump!",
				"A bridle ties a well-groomed speckled horse to a nearby tree. The horse is fitted with an elegant but empty saddle. Who does it belong to? Do the PCs take it?",
				"A powerful storm forced you to take the only available refuge: an elderly couple’s home just off the side of the road. The two room home holds numerous open cups of the same pungent liquid.",
				"A naked bard asks for a lift to the nearest inn where he left his clothes and money.",
				"Alongside the road, a charlatan asks the party if they want to see a performance of his trained pets. The slightest affirmative answer causes Steve to give a whistle, and a huge swarm of ravenous locusts suddenly manifests.",
				"A fat friar hurries past the PCs mumbling, \"It isn’t fair.\"",
				"An evil wizard is tied to a stake, the body still smoking.",
				"Three young men work on tipping over an occupied outhouse.",
				"A band of orcs runs toward the party. They look over their shoulders and try to run through the party. Something dreadful has terrified them, and the party is heading in its direction!",
				"Traveling off the main road, the PCs feel like they are being followed. Who is hunting them?",
				"Three types of meat hang on a spit over a campfire. It is clear that it is three types of humanoids that hang over the flames.",
				"A snowy road hides a sinkhole that chutes the party on a slalom slide down the mountainside.",
				"A well-spoken bugbear wearing fine studded leather armor is trapped under a fallen tree. He begs the party to come to his aid.",
				"A ranger stops by the group’s camp one night and gives them advice on the trail ahead, including places to camp and a tavern where they can get good rates if they mention his name. All his advice is impeccable, but when they mention his name at the tavern, they’re told he died years ago on that very road.",
				"A shopping list for potions lies on the ground.",
				"The local baron has enacted a toll bridge. Several peasants were unaware, and cannot afford the toll. They beg the PCs for change.",
				"You find the remains of a pouch that contains coins fro ma land you do not recognize.",
				"The party hears a long stream of curses further up the road. Then they spot a head in the road. A person is still alive, buried up to his neck!",
				"An arrow hits a nearby trunk, a message wrapped around the shaft.",
				"A bridge is missing. Where it used to be is now a ferry service, for a sizable fee. The ferry looks like it might consist of bridge parts, and only takes a few travelers at a time.",
				"A loaded wagon travels down the road toward the party, but it has no apparent means of propulsion.",
				"As bandits attack, the PCs realize a friend of theirs is among the robbers.",
				"There is a mysterious flicker ahead, and one member of your party suddenly stops, paralyzed.",
				"Orcs gather twigs and berries along the road and it’s clear they have non-hostile purpose. Will the PCs attack just because they are orcs?",
				"A tree falls onto the road. Then a fireball blows up the tree. It appears the PCs are in the middle of a skirmish between druids and fire wizards.",
				"Flowers by the roadside turn their heads to follow the party, and they’re getting larger.",
				"An overturned beer cart lies in the road. Nearby, an enormous troll snores loudly, surrounded by empty kegs.",
				"A set of shackles lies at the side of the road.",
				"A village can be seen to the west. It isn’t on any of the maps.",
				"Three pilgrims trudge along the dusty road, an old man and two young men. Simple travelers? Or are they more than they seem?",
				"You stumble upon an old scroll case wedged between a tangle of tree branches. Inside is a village’s charter of rights and freedoms.",
				"A dead magic user clutches a scroll in his stiff hand. The scroll says something important.",
				"A single giant footprint lies along the path. There are no other signs of such footprints in the area.",
				"You party awakens to find all your gear has been stolen during the night. A quick search reveals twelve sets of tracks and, lying in the middle of your campsite, a smoldering pouch of herbs that, when you sniff them, make you feel slightly drowsy.",
				"An enormous dragon lands on the road in front of the group. It asks for directions to a certain village, gives the party a generous tip, and then flies off saying he intends to raze it to the ground.",
				"An exotic, almost alien weapon or tool lies on the side of the road.",
				"The PCs mysteriously repeat a piece of road they already passed, though the route has been perfectly straight to this point. The road even includes their footprints.",
				"A dozen townsfolk are running after a fleeing woman and attempting to stone her to death for being a prostitute.",
				"Two other adventuring groups are arguing in the middle of the road.",
				"You see a man-sized shadow from the left side of the road waving its arms at you. \"Over here, quickly, I’ve caught one!\"",
				"A person fleeing arranged marriage seeks refuge with the PCs.",
				"Picked mushrooms lay on stump to dry.",
				"A strange old man offers the PCs a scroll in a language they cannot read.",
				"Gnomes are holding a yard sale! They have any number of strange and fascinating contraptions.",
				"Someone has scattered caltrops across the road.",
				"You encounter a monk, a monkey, a turtle and a pig, all heading west.",
				"A weathered sign points off the road, yet with no apparent trail to follow.",
				"The next 100 feet of road are covered with newly grown grass.",
				"Ladies clothing and under clothing are strewn in the bushes along the road. How did these get here?",
				"A formerly brilliant wizard, now pesters the party with the incoherent rants of a man driven mad by a botched invisibility spell.",
				"A drunken dwarf staggers along, challenging everyone to a wrestling match.",
				"A goblin, on fire, runs shrieking past the party.",
				"A rock with an odd, glowing rune sits by the road ahead.",
				"A noble, disguised as a filthy beggar, tests the party’s compassion and generosity. If they pass whatever standard he sets, then he becomes a source of various quests that require personal sacrifice to accomplish.",
				"A circus is set up alongside the road. A barker on the roadside cajoles you to \"come inside and see what wonders it holds.\"",
				"The road crests a hill, and spread out before the group is a stunning, sweeping vista of the land beyond. A painter sits nearby, capturing the scene, and asks the group to pose for his foreground.",
				"An overturned rowboat sits on the side of the road. There is no river or stream nearby. Under the rowboat is an entrance to a lair.",
				"A wandering cleric begs the heroes to recover a relic for them.",
				"A road sign saying where you came from is ahead of you.",
				"A group of guardsmen hang wanted posters on trees. One face looks familiar to a PC.",
				"A carriage is stuck high up in a tree.",
				"In the morning while breaking camp, the PCs spot a bush that wasn’t there before.",
				"A beautiful woman, adorned in the robes of an enchantress, emerges from hiding near the road and implores you to lend her aid.",
				"The road is lined with snakes sleeping in the sun.",
				"A necromancer uses his talents to animate animal and human corpses and forces them to perform in a roadside circus. The townsfolk from a nearby village seem to enjoy the show a bit too much.",
				"A chain gang digs ditches beside the road.",
				"A traveling minstrel challenges the wisest looking member of the party to a storytelling contest.",
				"A wizened tinker sells charms from his cart: dried frogs, finger bones, cat skulls, and the like. Leaving him, you turn to find he is eerily out of sight altogether.",
				"A paladin of a holy church and his retinue have ridden out on a holy crusade against evil and demand others who serve the cause of good to join their cause on the spot.",
				"The road starts to get muddy. Soon the mud is two feet deep. Water in the ditches alongside starts to bubble.",
				"A majestic elk sprints past with something golden caught in its antlers.",
				"A stranger on the road tells each PC to repent of their sins. He knows details.",
				"A door stands beside the road, but there is no sign of the rest of the house.",
				"A wine merchant’s wagon has shattered a wheel and he offers passers-by cut rate prices on his wares as it is getting repaired.",
				"An ugly old woman struggles to bring her wash basket of wet clothes up from the creek to the road. She stumbles and drops the laundry back down the slope.",
				"A monk, collapsed and bleeding on the roadside, pushes an unremarkable ring into a PC’s hands and desperately whispers, \"You must…\" before exhaling his last breath.",
				"A lost gnome asks for directions.",
				"A dead raven lies on the road, pierced by a bright blue fletched arrow.",
				"A table on the roadside holds a large basket of fresh vegetables. A sign reads \"1 copper a bunch: honesty is a virtue!\"",
				"You find a small leather bag. It smells of moisture, and contains a set of keys and a vellum map to the location of a small keep.",
				"The road is littered with bear traps.",
				"A thick fog has settled on the bridge ahead.",
				"The group arrives late at night at a tiny village straddling the road. They secure accommodation and food from the friendly locals and fall asleep. In the morning the village is empty and ruined, as if abandoned years ago.",
				"As the road passes through a hilly region, you spy a cave, from which can be heard the voice of a singing female.",
				"As you turn the corner, a dwarf and elf are standing over a stack of goblin corpses. They argue over the kill count.",
				"The party notices a sudden and drastic change in temperature, then just like that, things are back to normal.",
				"A little girl is watching you from just off the road. The next time you glance over, you see a wolf run away.",
				"An ecstatic farmer presses a cigar into your hands and proclaims, \"It’s a girl!\"",
				"Scratched into the dust of the road are the words, \"Good luck tomorrow. You’re going to need it.\"",
				"The entire party suddenly loses their bearings and realize that they’ve walked the same mile three times. Are they road weary or are they caught in something manipulating them.",
				"Wolves stalk you from just beyond the tree line. You can see their eyes flashing in the shadows. Look at them run: sometimes on all fours, sometimes on their hinds legs alone. They’ll attack if you show weakness, or if something else you encounter does, and try to drag off as much meat as they can carry in their slavering jaws.",
				"A pitch-painted corpse strung up in a gibbet. Crows crowd around it. They’ll tell you why he died if you feed them an eye.",
				"A repentant bandit, cheeks running with tears, hands stained with blood. Coins and jewelry stuff her pockets.",
				"A carriage comes barreling down the road, pulled by mad-eyed and foamy-mouthed horses. The coachman screams, laughs, and cracks a whip of fire.",
				"Diseased pilgrims, seeking a cure at a distant shrine. They’ll spit on the rude or opulent, and their spittle carries their disease.",
				"An inn, warm and welcoming. Should you stay the night you’ll wake to find yourself in a bed of moss, the inn seeming to be a faded dream.",
				"A mudslide off a hill has hidden the road here. Finding where it picks up again will be difficult among the debris.",
				"A lost, belligerent drunk who tries to pick a fight over any vague provocation. Among their possessions is a bottle of impossibly potent fairy-wine, half-finished already.",
				"A merchant convoy, lightly guarded. Something’s been killing their guards off. They’re eager to hire more, and will offer premium wages. There’s a curse on the convoy, or someone travelling with them, or something they’re carrying. It will continue to kill until it’s lifted.",
				"A military patrol.",
				"Some paranoid deserters on the run.",
				"A runaway noble child. Bounty hunters are close on their tail. Both will lie through their teeth to escape or capture their quarry.",
				"Poor drainage has rendered the road here a muddy bog. A highwayman with a crack shot lies in wait to rob passers-by when they get slogged down in the mud.",
				"A dead rider strapped to their horse. A branch has been plunged through the rider’s chest, pinning a blood-stained note there. The note reads: “This place holds its own laws”.",
				"Beautiful music is carried by the wind from somewhere off the road. Following it will lead you nowhere good.",
				"The shrine of a god whose worship is forbidden in more civilized places. 50% chance that a handful of worshipers are here, 50% chance that only some minor offerings are here.",
				"Cracked porcelain plates, bent silver cutlery, and picked-over food litters the ground here, as if someone had a fancy dinner in the middle of the road.",
				"A legless zombie slowly dragging itself along. Its fingers have been worn to the bone. It ignores everything that happens around it.",
				"A gate has been built here out of a giant, cyclopean skull. Golems carved from the skull’s teeth stand guard and collect a toll from those seeking to pass through. Collected tolls are stashed in a nearby shed with walls made from the skull’s jaw. Nobody’s been by to pick them up in a while.",
				"The road ahead’s been torn up, apparently by the claws of some massive beast.",
				"A vigilante mob pursuing a fugitive.",
				"A girl smoking a huge pipe packed with her parents’ ashes. Their ghosts can be seen smiling from the smoke she exhales. They’re watching over her as she travels to a relative’s home.",
				"A small bridge with a goblin underneath playing at being a bridge troll. Will be ecstatic if you humour it, offer to show its collection of “tribute”.",
				"Roadside sign painted with blood, warns you are entering territory of fearsome monster.",
				"Strapping young farm boy headed to the big city to pursue his dreams. Dangerously naive.",
				"Fellow travellers who tell only somewhat accurate stories of the dangers you might face ahead.",
				"A terrified herd of deer charge across the road, trampling everything in their path.",
				"You recognize your surroundings. You’ve gone in a circle, but that should be impossible. Somehow the road has imperceptibly curved in on itself.",
				"A cart full of goods pulled by a donkey with no master in sight. The donkey can’t talk but understands speech and is intelligent enough to barter. It values fresh produce, brushes, and similar things of donkeyish interest over gold. Anyone who harms or steals from it will be cursed with enmity from all hoofed animals.",
				"A small gang of brigands struggling through a bout of food poisoning from stolen supplies. 50% chance they’ll try to intimidate you into walking past and ignoring them while vomit dribbles down their chins, 50% chance they’ll try to rob you and probably shit themselves doing so.",
				"The road disappears like morning mist, a fading illusion. You’re off the road with no way back you can see.",
				"You’ve come to a crossroads. Something’s been recently buried at the center of the intersection. Yelling and pounding can be heard, dulled by the dirt between you and it.",
				"Tired and panicked refugees. Their village was attacked in the night, and they are the only survivors.",
				"A headless horseman. His gaunt horse wears a box around its neck. He challenges those he passes to a duel. No wounds truly harm the horseman except those dealt to his severed head kept in that box. The horseman won’t kill those who surrender.",
				"An obvious tripwire crosses the path. The trap it once triggered has long since fallen into disrepair.",
				"The road passes through a small valley here. The valley will become narrower the more evil you’ve committed in the past week.",
				"A section of the road here is paved with ancient bricks. Some bricks are printed with faces, each face different, some happy, some sad, some fearful, and so on. Stepping on or poking a brick will cause it to release a noise appropriate to its expression. Too much noise may attract unwanted attention.",
				"A chain gang and their sneering overseer work to clear the road here. The prisoners will try to use you as a distraction for their escape plan.",
				"A lumberjack wrestling with a bear. He knows of many interesting landmarks in the area, and would happily act as a guide if rescued.",
				"A ditch beside the road is piled near full with bodies. None of the bodies have faces.",
				"A cairn stacked by the road. Its stones pin down a moaning revenant into a forced grave.",
				"A pack of wildmen tear up the road. Its presence in their wilderness offends them. They’re hostile to anyone carrying the taint of civilization, but will try to scare you off or convince you of the virtues of their way of life before they attack.",
				"A lone wine merchant with a broken leg and a broken cart, and most of her goods already pilfered. A bit of a ways off an ogre has drunk itself halfway to unconsciousness. Rages clumsily if attacked, but starts off lazily amiable.",
				"Heavily cloaked underworld merchants of frightening countenance. Bringing tribute to the one who ruled the land above them, but are willing to offer some exotic wares on the side.",
				"Thieves disguised as travelling priests. Will offer drugged libations and steal your stuff after you pass out. Their knowledge of theology is comically inaccurate.",
				"Celebrants from the festival of a nearby hamlet chase each other down the road, each wearing a crude animal mask. Brownish drool leaks from the corners of their mouths. The festival involves the consumption of irresponsible amounts of a narcotic root, and the celebrants are all on the verge of stimulant-induced psychosis.",
				"A wandering bard of tremendous talent and annoying arrogance. Will be inspired by this encounter to write a song about you, which will become quite popular and shape your reputation.",
				"A sleepwalking woman in a fine dress and shoes worn to scraps. Her footprints are bloody.",
				"A dwarf in a manic building frenzy, paving the road with hand-quarried stones.",
				"A boom of approaching thunder, the promise of a brutal storm soon to come.",
				"Rival stone-shod trolls on each side of the road. They cannot tread upon the works of humanity. Both promise increasingly outlandish things to the one who brings them their rival’s head.",
				"The road here is blackened, its dirt mixed with coal dust. A spark could set the whole area alight.",
				"Rough priests erecting waystones to appease the road’s spirit.",
				"The road here’s been expanded on by unknown hands, built into an enormous glyph.",
				"A hummingbird-shaped silver medallion has been stamped down and dented into the road. The medallion shivers in the presence of the undead, and when swung or wrapped around a fist deals damage to the undead as a magic mace.",
				"A branded criminal hanged from ramshackle gallows and still kicking their feet uselessly. The knot around their neck is cruel: it prevented both the breaking of their spine and strangulation, leaving them to dangle until they die of dehydration.",
				"An empty, bloodied carriage turned over by the roadside. Nearby two horses with tattered harnesses and iron spikes hammered into their gums chew on a corpse.",
				"A smith and their apprentice delivering a custom-ordered suit of armour to a noble patron. Its craftsmanship is exquisite.",
				"An itinerant caravan. They mostly carry junk, but it’s all cheap. They can also perform quality repairs at a low price.",
				"A traveling physician capable of performing unlikely surgeries, like limb transplants between different species. The secret to their ability is a sentient medical tome in their possession. Their work is charitable and has saved countless lives, but the book will eventually drive them to create a fleshworked abomination.",
				"An unnatural darkness falls over the area that no mundane or magical light can illuminate. The road must be felt out by hand and foot.",
				"A small figure in a red coat can be seen in the distance off the path, and shrieks and runs away when spotted. If followed the figure will lead you to a moldy skeleton wearing the remnants of a red coat, and a basket full of magical reagents.",
				"A nomadic circus is being held captive here by a band of ogres, who are eating anyone who tries to escape or fails to amuse them.",
				"A merry camp of hunters following an unusually plentiful herd of game. There’s plenty of drinking and gambling going on, and safety on the road in numbers.",
				"A depressed and debt-laden person pretending to be a bandit to commit suicide-by-adventurer.",
				"Some hungry, feral dogs. Won’t attack anyone who shows them kindness.",
				"Teeth, human and otherwise, strung through with twine and hung on the trees like tinsel.",
				"A procession of robes figures. The robes are empty save for glowing, floating wisps filling the hoods. If a figure is touched their robe will collapse and their wisp will fly off across the sky.",
				"Patches of the road here and there are ever so slightly discoloured. Those patches are the camouflaged hatches of giant trapdoor spiders, waiting for the vibrations of passing prey.",
				"The road branches off here, and the branch is being blocked by a squad of soldiers. That way leads to a village which is being quarantined to contain a bizarre contagion.",
				"A false second sun passes far overhead. Its exhausting, desiccating heat makes travel difficult. It has been sent out from the nearby tower of a heretical astrologer.",
				"A party of fellow adventurers are having a roadside picnic. They invite you to join them and share stories of your travels. If you reveal you’re after a nearby treasure they get tense, as they’re after the same.",
				"A rider relaying an encrypted message of great importance to high-level politics.",
				"A runner practicing for an athletic competition.",
				"A swineherd driving their livestock to greener pastures. Unbeknownst to them, a hungry monster is stalking close behind.",
				"A cult fleeing persecution elsewhere. Their half-human leader is carried in a veiled, over-sized palanquin atop their straining backs.",
				"A huge, gnarled tree with veiny purple welts sprouting across its trunk. Naked, obese people lean on the tree, scratching its welts then licking their fingers. They mutter something like prophecies. Consuming the calorie-dense fluid from the welts will grant clairvoyant visions and reduce awareness of one’s own body. Roll 1d6: 1, the welt-lickers are the only ones here; 2, weeping children are trying to pull one of them away from the tree; 3, a botanist seeking a cutting from the tree lies mauled nearby after having been attacked by the welt-lickers; 4, an oracle trying and failing to debate their predictions; 5, a scholar furiously scribbling down their every utterance; 6, a ghoul is picking off the welt-lickers one by one as a living larder.",
				"A pair of conjoined twins stuck where they are, each twin trying to pull the other in a different direction.",
				"An aggressive preacher seeking converts on the road.",
				"An artist seeking inspiration. Will pay for directions to strange locations.",
				"Meteor-miners, rushing to the site of a recent impact.",
				"The house of a shapeshifting spider-hag. She used to trick travellers then eat them, but has become bored with this routine over the years. Now is more likely to safely entertain travellers for the night in exchange for carrying one of her eggs to new hunting grounds.",
				"A killing wind sweeps through the area. For 1d6 rounds (exploding) no one in the area can breath, anything people-sized or smaller risks getting blown over.",
				"Crushed glass has been scattered over the road. Anyone walking barefoot takes damage while moving over it. Bloody, inhuman footprints dot the ground. An invisible beast stalks somewhere nearby.",
				"A noble prisoner is being dragged to trial in a wheeled cage by jeering guards. The prisoner offers to share their forbidden grimoires with the one who frees them.",
				"A deep and painful chill falls across the area, preceding a march of icy fairies.",
				"A body pinned to a tree by many, many arrows.",
				"There’s a pothole in the road. It goes way down. A sulphurous scent wafts from it.",
				"A hedge wizard-turned-bandit who threatens to blow herself and her target(s) up with an alchemical bomb if they don’t hand over their magic objects and money.",
				"A mystery cult enacting one of their core myths. Onlookers will be shooed away or lethally incorporated into the mythic reenactment if they persist.",
				"Eloping star-crossed lovers.",
				"A freelance cartographer.",
				"A band of bored mercenaries.",
				"A bandaged and shellshocked adventurer carrying two partial skeletons in a bundle on their back. Retiring after an unsuccessful delve.",
				"Horse traders bringing a steed of peerless pedigree to a client.",
				"A grim and pale clan riding together with a coffin in their wagon. They claim they’re off to bury their grandmother in their ancestral plot, but in fact the coffin holds a fledgling vampire seeking to found a base of power.",
				"A pair of philosophers arguing over the essential goodness (or lack thereof) of humanity. They’ll try to get you to weigh in on one side or the other.",
				"A wizard experimenting with a horseless carriage. The carriage is powered by (1d4): 1, mutagenic alchemical fumes; 2, predatory slimes in hydraulic tubes; 3, howling poltergeists whose bones decorate the carriage’s walls; 4, A bound demon.",
				"Dazed people with slack-jaws and bulging cheeks stumbling along. Fat centipedes are hiding in their mouths, halfway burrowed into their brainpans. The centipedes are driving their hosts towards a spawning ground.",
				"Your destination. The road has been miraculously shortened.",
				"While traveling on the road, you come across a massive tree that has fallen in the middle of the road. It will take 1d10 hours to clear. Unbeknownst to the party, a massive ogre is hiding in a nearby cliff waiting for an unsuspecting caravan to wander into his tree trap.",
				"The main road has been washed out. Crossing the gap would be dangerous and time consuming. There is an alternate route through the woods which are known to harbour a multitude of threats, but it’s faster than dealing with the washout.",
				"The party comes across a caravan in distress. Bandits have been known to set ambushes like this to catch unsuspecting travelers, but there are also rumours of a merchant caravan that’s late returning from the capitol. What do you do?",
				"A lost child wanders the road, heading back the way you came. It’s too late in the day to get back to town before nightfall, and you need to be in the next city over by morning.",
				"You see a dying man at the side of the road. If you stop, he tells you that [Person]’s guards attacked and robbed him. You are en route to an audience with [Person] to negotiate a lucrative commission, and as far as you know, s/he is a pillar of the community.",
				"A blizzard swirls up, impairing vision and forcing players to make con saves against cold damage.",
				"A white stag/any other big game animal crosses the road and bolts. Do the adventurers pass on this trophy that could be worth money for its pelt/antlers/alchemical ingredients or do they go hunting?",
				"The party happen upon a hoard of coins (usually gold) in the middle of the road. It’s more than they can carry and there’s no obvious way to transport it. A group of level appropriate humanoids are circling around, intent on taking the hoard for themselves.",
				"You find the last survivor of a zombie/goblin/werewolf/etc. attack. He/she asks you to bring him back to his guild, which specializes in hunting this kind of monster.",
				"You come across the last survivor of a pack of peaceful werewolves who are being hunted by vicious werewolf hunters. He/she asks you to return him to the rest of the clan.",
				"You stumble into the middle of a fight between bandits and evil wizards fighting over a caravan of potentially valuable supplies. Neither party has seen you yet.",
				"A farmer or other commoner is transporting an offering to a fearsome enemy (giant, wizard, orc chieftain, etc.). He/she tells you that the village has managed to remain untouched by offering livestock/goods/gold in exchange for safety.",
				"You are approached by a zealous group of cultists. They begin preaching to you that the world is going to about to be destroyed by the god they worship, and ask you if you’d like to join their end-of-the-world party (attending reveals that the world is not, in fact, about to end).",
				"While passing through an abandoned farm, you come across a scarecrow that psychically whispers to you. It gives the party an “impossible” riddle and claims that if you cannot answer then it will not let you pass. Note: Scarecrow cannot move and players need not answer the riddle in order to simply walk past.",
				"A group of goblins standing on each other’s shoulders in trenchcoats trick travelers into coming to help fix their broken down wagon, and rob them for every copper they’re worth.",
				"The only way to progress is through the aftermath of a battlefield. Many of the traps put in place by mages haven’t been disabled yet, and the party must navigate safely through it.",
				"There is an illusory spell over the forest that they are traveling in that causes people to think that the road is taking them in circles. People who pass the save must convince the others that they are going the right way.",
				"There is a caravan of magical meat traders that are going from city to city. However, they only trade meat for meat instead of trading with gold.",
				"There is a tiny earth elemental trying to learn how to juggle. If the party tries to touch it, an angry mother will come out of the woods to attack them.",
				"A group of teenagers were smoking in the woods and accidentally started a forest fire. Unfortunately, the party is in that forest and needs to get out.",
				"The road comes to a large river. A new, high-quality bridge has been built over the river by a goblin clan who are seeking to overcome evil natures and to make an honest living. They are charging what is, in fact, a high if still fair fee.",
				"The path and map somehow did not mention a mountain that sits right in the middle of the road. The party did not notice the mountain until it was directly upon them.",
				"The village that you come to has just had adventurers a lot like your party come through, and have prepared an appropriate welcome. If your party are heroes, it might be fresh-baked bread. If your party is a bunch of jerk murder-hoboes, it might be tar and feathers.",
				"A large group of pigs are running every which way. A young girl in a ragged dress is trying to herd them together, sniffling slightly. If approached, she explains her father and mother are sick, but the pigs are supposed to be sold at the market, and they need the money for medicine.",
				"A worried-looking half-orc desperately tries to convince your party they are going the wrong way, and that they should take a similar (if slightly longer) trail to their destination. A religion check reveals that he is a cleric of a knowledge deity. If the party ignore him, he tries to convince them for a while, then shakes his head sadly and begins trudging away.",
				"A small stretch of woods are petrified in place and time, completely silent and perfectly still. Anyone touching anything but the path in the forest finds it hard as stone and completely immovable. There are birds and other animals in the forest, but they too are as still as statues.",
				"A vicious squirrel begins throwing nuts and chattering at the party. It doesn’t do any real damage, but it is painful and annoying.",
				"A nest of baby hydras! Kill ’em, avoid ’em, or (with a successful handle animal check) take one with you! Where’s the mother, anyway?",
				"Someone has left a trail of copper pieces, leading off the road to a cave. The cave is heavily trapped and ends in an empty chest. You hear giggling when the chest opens, but no one is in sight.",
				"A large group of pilgrims and flagellants are making their way slowly up the road in front of you, slowing you down. They make no attempt to give ground to you and eye you with some vague hostility.",
				"A deep moat has been dug across the path in front of you. Two gnomes on the other side are looking at a map and blueprints and arguing with each other. They make no attempt to help you cross.",
				"An 8-year old boy is peacefully leading a giant pit fiend/ Manticore/ Purple Worm on a chain behind him down the road. If asked about it, he laughs and says, “oh, that’s our cow. She just likes to play tricks on strangers.” He then ruffles the- whatever- and continues on his way whistling.",
				"Your map failed to mention a road inn halfway to your destination. The inn is completely empty with the door torn off it’s hinges. With a local knowledge/geography check you know that this inn shouldn’t even be here, this was once the location of a grave site.",
				"An armored retinue of Soldiers and Clerics bearing a King’s/Lord’s/God’s banner have set up an inspection point, requiring all passing through to declare their belongings, allegiances and purpose for passing. Zone of Truth, Detect Evil and Good, and Truesight are in use.",
				"You come across 2 NPC’s arguing over which one is real, and which is a hallucination.",
				"You discover a 50ft wide flowing river crossing perpendicular to your path. This same river can’t be found on any maps.",
				"A great human knight has just died of a heart attack as he travelled down the road. His squire and page have pulled him to the side, and one has gone to fetch help. The knight has powerful magical armor and weaponry which would fetch a pretty penny, and there are robbers about…",
				"The road is completely blocked off as if an avalanche or rock slide occurred. Problem is the area is pretty flat and you don’t understand how the rocks got here.",
				"A group of animals have been killed and aligned in a strange formation with weird symbols drawn in blood. Party could find out this was used for a ritual of sorts.",
				"You turn a corner and the road ahead is blocked by a pool of lava. Upon inspection, there is no heat. Futher inspection will reveal it is a illusion spell. Perhaps a silly prank by a wizard. You can walk through the lava.",
				"As you make your way along the road, you come across a rotting dead animal carcass. The smell is horrid, but it is nothing out of the ordinary. As you continue, a few more animal carcasses are strewn across the road. More and more bodies begin to appear along the road the further you go. You eventually come face to face with a 20ft wall stacked full of bodies ranging from livestock, predatory animals, and even people. The wall blocks the road, and the only ways to proceed include scaling a nearby muddied-with-blood slope, backtracking to find another route, or digging through.",
				"The travelers find themselves at a crossroads, then the same going forward, and again. The party is trapped in a magical loop, until they can dispel it or notice the difference in the pattern, such as flower locations or a bird’s flight path.",
				"You were sold bad travelling gear at your last stop – the rations are worthless, the water tainted, the leather goods falling apart.",
				"Flash Flood: A downpour upstream has triggered a flash flood over a low part of the road. Although the water is 3 feet deep, the current is so swift that it will without fail sweep away anyone trying to ford it. Individuals swept away face the risks of bludgeoning, impalement on debris, and drowning. By stepping in it at the shallower edge, it is obvious to even survival novices that it will be extremely dangerous to cross, especially towards the middle. The party can choose to wait it out if they like although it will take a long while.",
				"Stampede: A large herd of bison/gnus has been spooked and is wildly stampeding down the road as it is the path of least resistance. Get out of the way or be trampled.",
				"Landslide: Heavy rain and a small earthquake triggers a series of small 30-foot-wide landslides. The party needs to book it before a larger one hits.",
				"Help with wheel repair: A traveling caravan of nomadic folk has a broken wagon wheel. The lady in charge is a seer and offers insight on your fortunes, but no gold, if you stop and help.",
				"Bad signs: A jerk has rearranged the roadsigns at an intersection so they point to the wrong places.",
				"Pulled over by the highway patrol: A peacekeeping army-guard convoy is marching through. They are corrupt and will harass and attempt to search the party and may try to take money or goods they find suspicious or the party cannot explain the providence of. They will also apprehend known criminals. The party may get most of their stuff returned by “appealing” (aka paying a bribe) to a similarly corrupt local court.",
				"The Wyld Hunt – The fey are out hunting. Beware. They have already chosen a quarry, but don’t stick around, lest one of them choose you as their next.",
				"After walking for a good few miles along the path down the clear road, you reach an invisible barrier. Then the illusion breaks – this Mirage Arcane made this deep cave look like a clear plains with a nice lovely stone path identical to the one you’ve been following. You are half a mile into this cave, and the fey who have lured you here do NOT want you to leave without doing something for them first.",
				"Modrons: Along the path you find a group of modrons (2 monodrones and a duodrone). These modrons were not given the return order during the last modron march (due to complications from becoming attacked) and are still trying to collect data. Upon noticing the party they harass them for data, doing things like surveying them and mesuring the size of their clothes while they are walking. They continue to do this until they either lose sight of the party or are destroyed.",
				"A fire can be seen just under a mile away in an obviously cultivated field, the wind now blows billows of smoke over the road the party is crossing. The field belongs to a local alchemist who has seeded it with various medicinal herbs. The smoke is highly intoxicating, impressing odd conditions and visions upon the party members.",
				"Improper care – the terrain has taken an unfortunate toll on your foot ware. Your soles are falling apart, movement reduced by 33%.",
				"A mounted knight in full tournament jousting gear mistakes the party for his entourage/bodyguard and insists that they escort him to his next competition.",
				"The party come across a revenant who is nearing his target. The target isn’t any one in the party but the adventurers have a chance to intervene.",
				"Someone in your party has dysentery.",
				"Everyone the party asked in the last town/village/waypoint has said the only safe way to get through the valley is to take the blue path, detailed and maintained by both of the communities it is flanked by. The villagers all said the upkeep was mutual, and that they were on very good terms with the other town/village/waypoint.",
				"Upon getting out of the first town’s territory, they find the rest of the path barricaded and blocked, the barricade older and written in an archaic version of the prime language. The trees and animals all look like they are from a different time. There is a ‘detour’ path but it’s filled with primeval dangers.",
				"While traveling the carriage you are riding on hits a rather large bump causing an already weak axel to snap rendering the carriage useless. The party must either find a way to fix the snapped wood so that they continue, or they can try and convince another traveler to help.",
				"You find the rats have gotten into your rations. You’ll either need to make constitution saving throws or find new food.",
				"A massive and extremely powerful dragon ambushes you somewhere along your journey through a massively dense and vast forest. It is strong enough to slaughter you all without trying, and is upset that you are not aware of it. Gonna have to talk fast to appease it. It also desires a rare food item you possess, and will allow you to pass if you offer it the food and an appeal to its vanity.",
				"This actually happened to me in a campaign: An axle on the cart breaks and a druid, in an attempt to repair the cart, accidentally Druidcrafts the wooden wheel or another wooden piece of the cart into a bush.",
				"There’s been an earthquake, and the pathway is blocked by something. It might be a fallen tree, a crack in the ground, or a piece of land that broke off a mountainside. Either way, it’s going to be difficult to get past it and nigh-impossible to get a cart across.",
				"Jack’s Lanterns – Strange lights can be seen far away, off the path. They hover over pits and quagmire, and will trap unwary travellers.",
				"Dimensional Instability – There’s been a small ripple in the planar fabric between worlds. For a few moments, another plane is open. It might be the Elemental Plane of Fire, the Feywild, the Shadowfell, the Astral Plane, or even one of the realms of the gods.",
				"Mystic Orchard – A large area filled with various trees and bushes, each one covered with different fruits. Food is plentiful, but some of the assorted berries might be poisonous or have a side-effect.",
				"Overgrowth – The path is overgrown with vines, grasses, and tree roots. It is difficult terrain to move past, and will take twice as long to cross.",
				"Oh look, it’s a giant stag. Roll 2d4. 2-4 means the stag charges. 5-7 means it looks at your party and moves on. 8 means it bows before you, granting your party a 2-point Charisma Bonus for the next week.",
				"A felled tree blocks your path, and the way around is blocked by dense overgrowth.",
				"You come across a large battlefield of some previous encounter with hundreds of bodies laying strewn across the ground and piles of corpses heaped into stinking mounds, crossing around will take a full day but if they cross through they need to make a Constitution save DC 15 or become sickened with rot from fly bites carrying disease which gives the poisoned status for 24 hours.",
				"The next town is roughly 50 days away around the mountain and the only other way is through a tunnel with a REALLY steep fee. (Or a SECRET TUNNEL)",
				"A mating ball of poisonous snakes is in the way.",
				"A herd of wild goats appear. One takes a particular liking to any dwarves in the party.",
				"The remains of a horse on the trail have attracted a bear. It’s too busy gorging to notice you.",
				"A forest fire blocks the path after a thunderstorm.",
				"Snow melt have turned a small creek into a massive raging river. The only bridge is destroyed.",
				"A recent landslide has resulted in several large boulders tumbling into a narrow section of the river, making it very difficult to navigate in the Dory boat the party is traveling in. The boat has an HP of 13, roll 1d4 x 4 to see if it safely makes it through, without the hull being opened up, which would cause it to sink.",
				"A mess of vines blocks the party’s way. Seems like a sharp weapon will be needed.",
				"Two bugbears are sleeping off their hangover in the middle of the road. You can try to sneak past, take a detour, or attack.",
				"Part of the path has been washed away leaving a large, deep mud puddle that is difficult to traverse around with the wagon/cart because of the dense bush either side. If the party chooses to forge through it takes them 2d20 minutes, and they end up covered in the thick, sticky, foul smelling mud. If the party chooses to clear a path to the side it takes them 3d20 minutes.",
				"You notice an abundance of sink holes in the field. Players bust be careful with their footing as well as not grouping up to close together.",
				"You find two exact similar dwarfs fighting each other with crossbows and taking cover. Both say the other is a doppelgänger. None of them is, they’re just lost siblings. One is named Thruduanir and the other is just named Greg.",
				"A small red skinned creature sits ontop of a rock on the side of the road. It waves to you and implies that it wants to play a game with you, to pass his test to get his higher devil horns. If not, he vanishes. Roll a d6. 1-2 the devil vanishes and leaves a small purse filled with coin, around 10gp.(the coins turn to lead in one hour) 3-4 a group of (appropriate) undead appears and will fight for their souls to be released by the devil. 5-6 a (appropriate) demonic being is brought into existence, will attack the group immediately.",
				"An old sagelike man sits on the side of the road and begs the party for food, water or gold. -If given food, he disappears and gives a blessing to the goddess of wanderers, the party will not be disturbed on their next long rest. -If given water/wine/ale, the old man hands the party an everflowing mug, containing what they gave him in the first place. -If given gold, he asks the partymember what his favorite animal is and then hands over a golden egg. Soon, a familiar of choice (will grow up to one feet tall) will be born from the egg. -If given nothing, he curses you and will stripe your party of half their rations and water.",
				"A hangman and magistrate with a constructed gallows are preparing to execute a man for poaching. The man sees the party and yells for help as the hangman struggles to get him in the noose.",
				"A “very human” child is drawing strange runes in the dirt with a bag of blue sand.",
				"A Traveling circus is coming the other way and they want to practice their act: A mind control/hypnosis performance. At some point the party realizes they have no intention of letting whoever they hypnotize leave the troupe.",
				"A dozen ogres are playing hide and seek. They don’t really feel like eating you, they just want to play.",
				"You find a merfolk in a barrel of water by the side of the road. You are at least a mile from the nearest water source.",
				"Half a skeleton grabs onto the back of your horse/wagon.",
				"All forms of vegetation along a lengthy stretch of the road have been transformed into glass, while the top inch of the terrain has transformed into obsidian. Along the sides of the road are statues of confused, frightened animals made from random rocks and minerals. All organic life in the area slowly begins transforming into various rocks and minerals over the course of one full day, at which point the organisms are petrified. A fully transformed organism may only be cured through use of Greater Restoration or a similarly powerful magical effect. Upon leaving the stretch of the road, any partially petrified creatures have the transformation process occur in reverse at the same rate.",
				"A friendly, sentient dust devil comes across the party and follows them around for 1d4 hours, behaving like an excited puppy for its duration. It communicates by swaying forward and back for affirmation, and left and right for negation.",
				"A speaking animal, like a frog or a bird, is passing your way, looking for direction and a way to be polymorphed back into it’s true form.",
				"A bare piece of plains, with a large stone set in the middle. The still legible inscription reminds of a great battle long ago. Ghosts are said to haunt here in the night.",
				"A flat corridor between mountain passes has many windmills dotting the landscape due to the constant and unvarying wind flow. One of the windmills lies in the middle of the path ahead.",
				"A large, deep depression in the ground that appears to be covered in smooth, gray-black glass. If one slips and falls in, it is very difficult to get out. At the edges, it fades into the soil, and there is grass growing in cracks in it. If broken, it is very sharp. There are several animal skeletons at the bottom.",
				"A recent landslide has exposed a large fossil in the middle of the path.",
				"Two wizards are dueling on the path ahead. They continually cast Ice Wall, making it nearly impossible to pass.",
				"A two-headed giant is napping on the path ahead. Do you try and fight, or sneak past him?"
			]
		}
	]
}