{
	"name": "Hidden Item Locations",
	"category": "Misc",
	"source": "https://www.reddit.com/r/d100/comments/9bm5vh/lets_build_d100_nonlowmagical_plot_twists_repost/",
	"data": [
		{
			"name": "Located",
			"data": [
				"Inside an oversized and clearly fake version of the item. Aka: a small key to a basement being kept inside of an oversized key-shaped paperweight. Funny, but also a clue. Particularly good if the person you’re nicking from is chronically forgetful",
				"In a roaring fireplace in a bag, box etc. out of fireproof material",
				"In a secret compartment that can only be found in a drawer or shelf if completely pulled out",
				"Inside a pillar coat rack. (e.g. the top unscrews and comes off revealing a hidden compartment)",
				"(Infos) On the back of an unsuspicious piece of paper with trivial notes",
				"In a book with pages cut out.",
				"In a false-bottomed drawer",
				"‘Hidden’ book with the cover of a different book on it",
				"In a compartment hidden behind a brick or tile in the wall (or whatever the wall is made of) or in a compartment under the floorboards",
				"Under realistic-looking fake excrement in the bucket in the Lord’s personal water closet.",
				"Embedded in a large candle. Wax was added to completely conceal it.",
				"In the mouth of a taxidermied animal head mounted on the wall.",
				"(Large item) A wall of an adjacent room has been cut out in the shape of the item, the item pushed halfway into the hole between the rooms, and then half sized furniture built around the item in question. For extra trickiness, put the item in the corner of four rooms with quarter-sized furniture. Walls should be thin and not loadbearing.",
				"In a box made out of a whole row of books that have been stuck together and put on a bookshelf as a unit.",
				"In a house plant pot’s false bottom. Nature check to know the plant’s roots are shallow and don’t need that much space.",
				"Secret compartment contained within another secret compartment with a precious item but not the wanted one. ex: secret panel behind picture reveals a compartment, another secret panel inside that compartment reveals another secret compartment.",
				"In a dark green bottle of wine, obscured by the label, hidden on the wine rack. Wine may also be in the bottle.",
				"Behind a fake plaster wall disguised to look like a real wall. The room is smaller on the inside than outside measurements indicate.",
				"Under a pile of trash",
				"In a chest with a false lid (hollow space in the lid)",
				"Small trap door underneath a chest",
				"In a small waterproof box, which is in a pot of yesterdays porridge",
				"Secret compartment behind a portrait on the wall",
				"Buried in a large bag of rice, grain, flour, etc.",
				"In a false bottom on a butter churn",
				"Between the bristles of a straw broom",
				"Camouflaged. The item is painted to blend in with the part of the room it occupies.",
				"On top of a joist in the ceiling",
				"Object is incorporated into a sculpture. Object looks as if it is part of the sculpture.",
				"Trapped inside a clay tablet. You have to destroy the tablet to free the item.",
				"At the bottom of a covered up well beneath the floor boards",
				"A full length mirror that swings out revealing a walk-in closet behind it",
				"In the base of an old trophy",
				"In the last doll in a set of nesting dolls",
				"Inside the workings of an expensive elaborate clock. (It would be really cool to have all the cogs and workings spell out a password or code, but it only lines up correctly at a certain time of day)",
				"Sewn into the linings of a wedding dress, where the dress is kept for sentimental value",
				"Inside a dressmakers doll",
				"Stitched into a pillow",
				"Concealed within a walking stick or umbrella",
				"Under the rug",
				"Stuck to the underside of a dresser drawer",
				"On/in a pet’s collar",
				"On top of the doorframe (for very small items)",
				"Inside a mattress",
				"In the pocket of an old coat within a wardrobe",
				"Inside the bust of a famous person, the bust needs to be smashed to retrieve the item",
				"Inside a ship that is inside a bottle",
				"In a large pile of similar items (eg a bucket of keys or a pile of parchment)",
				"The maid of the house swallowed it.",
				"Stitched to the back of the drapes",
				"Inside the cavity of a string instrument",
				"Inside a mouse hole in the wall",
				"Underneath the ashes in a fireplace",
				"Behind a loose brick inside a chimney",
				"Baked into a loaf of bread.",
				"In the hollowed out handle of a tool or household item (e.g. frying pan).",
				"Behind a painting, or within the frame of a painting.",
				"In a small barrel of lamp oil.",
				"Hidden in plain sight, looking like a part of a ornament,furnishings, held by a statue with a strong grip or painted to look like the wall so it’s difficult to see.",
				"In the soil of a flower pot",
				"In a hollow table leg",
				"In the dog",
				"Object disassembled into smaller pieces and each piece hidden in a different location in the room",
				"Underneath or behind a large metal safe",
				"Sewn into the lining of a tapestry",
				"In a birds nest in a bird cage",
				"Inside an urn of ‘x’ relative’s ashes",
				"Inside a laundry basket of unwashed clothes",
				"Inside a ball of yarn",
				"Item is cleverly painted to look like a poorly made fake of itself. bonus put a realistic looking fake and counterfeiting tools next to it",
				"Never actually hidden, just got eaten by the cushions of the couch",
				"Covered in soot & placed in a dark corner",
				"Inside a fake door lock, lock is actually a little box built into the door. key opens the box.",
				"Inside a spittoon",
				"Underneath one of the muddy shoe prints, that are caked on the floor by the shoe stand",
				"In a small hollow underneath a window ledge on the outside",
				"In a hollowed out wheel of cheese",
				"Tied in the middle of a bunch of herbs that have been hung up to dry",
				"Inside an ox or rams horn bugle trumpet",
				"Under a wig",
				"A voluptuous bust of a famous actress, the item has been cleverly hidden in the depths of the status cleavage.",
				"In the alimentary canal of the corpse inside the coffin.",
				"The Room has been ransacked to make it look like someone else has already searched it. Item is still hidden in the room",
				"Inside a gourd flask",
				"Inside a wineskin or waterskin",
				"Inside a puzzle box (can’t be opened unless you solve the puzzle or destroy the box)",
				"Inside an animal skull, sitting on a desk or shelf",
				"Inside an (empty) inkwell",
				"In the mouth of a bearskin rug",
				"Inside a sea sponge sitting on a desk or shelf",
				"Inside a pinata",
				"Inside an empty hornets’ nest sitting on a desk or shelf",
				"Inside a conch shell",
				"[NPC involved] Use sleight of hand and pickpocketing to hide the object on the person searching the room, then pick their pockets to retrieve it as they are leaving",
				"[NPC involved] Use sleight of hand to pass the object between accomplices, so when searching the object it’s never on the person being searched",
				"If in a mansion or palace, attached to the underside of a dumbwaiter",
				"Inside a bellows",
				"Inside a fake egg",
				"Attached to a painting in a way that makes the object look like part of the painting",
				"The object is not hidden at all, but there is a note attached to it that says (to the current owner of the object): ‘Your item is safe and stored at the agreed location. I finally finished your requested replica and left it here. I hope you are satisfied with my work’. But there is no replica and this item here is the original."
			]
		}
	]
}
