{
	"name": "Demonic Contracts",
	"category": "Misc",
	"source": "https://np.reddit.com/r/d100/comments/8ujeuo/lets_build_thing_demonsdevils_ask_for_in_their/",
	"data": [
		{
			"name":"Contract",
			"data": [
				"Use of your voice for a day. Your voice (which is from someone true and pure of heart) is used to chant a ritual with thousands of other borrowed voices to do something very evil. The evil ritual tainted your voice and now lawful beings have taken notice of the rituals completion and don’t really care for the defence that you weren’t there, your voice was the one chanting.",
				"You must sacrifice a percentage of money to the demon each time you make/find money.",
				"The demon appears as an attractive figure matching the Player Character’s greatest desires, perhaps even the one they are in love with. The demon asks the Player Character to kiss them, and to kiss them like they would someone they love. An offspring is created by the kiss, a half demon half [Player Character Race] which grows rapidly towards adulthood.",
				"The demon requests a piece of the Player Character’s soul; not their entire soul, but just a piece of it. Permanently reduces the maximum HP of the Player Character by 20 and they have disadvantage on CHA checks when dealing with Paladins, Clerics, or general members of the Clergy.",
				"You must betray a party member who is not aware of your contract and who is your friend by stealing from them, spreading rumors about them or something else to amuse the devil. It has to be clever.",
				"You must kill the next person who asks you for help, even if it is just a poor man asking for food, instantly.",
				"You must abduct a suitable wife for the devil, who will take her to the underworld (a bit like Hades and Persephone).",
				"From now an any gamble you make is a guaranteed loss for you.",
				"You must vandalize a sacred site, altar or church of any good aligned deity.",
				"You pay with your mortal time, making you age rapidly into an old person, grey hair (and beard) with old skin and muscles within the next day.",
				"Strength and Max HP are lowered by 3 and 5 respectively, roll 1d6: At a 1 or 6 your Charisma is increased by 1 otherwise lowered by 2.",
				"The demon will request that the Player Character give them their first born (or in the case of the Player Character already having children, their next) child for one day during his or her first week of life. The demon will feed the child 3 drops of its own blood. The child grows strong and powerful from this treatment. He or she beomes forever an indentured servant to the demon. The demon has made this pact dozens of times, in doing so the demon has collected an army of powerful beings.",
				"The Character must do a small evil thing each day. It’s minor, but it it helps spread misery. Kick a puppy, steal groceries from a senior citizen, trip a blind person.",
				"The Character must perform a moderately evil thing each day. It’s still not killing, but it is full of hate and brings pain. Grafitti a house, send letters to soldier’s widows that state they are burning in hell, terrorize a household of minor or monster races, break store windows, hand out pamphlets decrying the existence of a particular sub group (religious or otherwise), steal food from the starving, rob an orphanage, etc.",
				"The Character must perform a single truly evil act. These are the truly evil acts. Assault, murder, etc. Things the get life sentences, if not execution or exile.",
				"The character must say something opposite of their nature to a loved one at least once per day, with the number increasing from day to day depending on how many things the character does against the demon/devil’s desires.",
				"Devil: collect on another contract made several decades ago. The terms of this contract remain unknown. The mortal who signed the first contract is advanced in years and either doesn’t remember the contract due to their memory failing, or starts begging that there is still time.",
				"One of their eyes. Perhaps the players fight a demon with the single eye in the future?",
				"Abbysal: 66.6% of all blood for the next googol of years or the end of the claimant’s life, whichever comes last, must be left at a altar to dark powers. This allows one to as a standard action call a random abyssal ally once daily, who will do tasks for the claimant. The ally may demand additional payment for services rendered, depending on the complexity of the task.",
				"Infernal: 66.6% of all income for the next googol of years or the end of the claimant’s life, whichever comes last, must be left at a altar to dark powers. This allows one to as a standard action call a random fiendish ally once daily, who will do tasks for the claimant. The ally may demand additional payment for services rendered, depending on the complexity of the task.",
				"Anyone who signs the contract will always be slightly outshone by their companions in any legends told. Saved a kingdom? The bard will mention everyone, including you, but your stanza will be just that much less remarkable than the others. This only applies to secondhand accounts: anyone who witnesses your deeds will see them as they truly are. Complication: The fiend itself is a Glory Leech, and its sustenance is the renown of those it gives contracts to. After you’ve done enough deeds, and the Glory Leech has nourished itself on your relinquished fame, it has the strength to take your place…either actually possessing you, or manifesting as the ideal version of you who everyone unrelated sees as having really done all your great deeds.",
				"The fiend requires as its price that you have a recurring cold. It doesn’t hamper you mechanically (or perhaps gives only a small disadvantage to pure CON checks, of which there are few), but you are Always. Sick. Your companions notice it, NPCs notice it; it feels like you have Fantasy Allergies and no restorative magic can remove it. Complication: The fiend had a powerful curse bestowed upon itself, and has found a way to gradually rerout and ‘metabolize’ that curse through you. After 1/5/10/50 years of dealing with this cold, one day you wake up to find that it is gone once and for all. However, the fiend is now no longer restrained by its curse. It shows up to thank you for your assistance…and perhaps, for good or ill, it does something more.",
				"The fiend wants your nickname. If you have multiple nicknames, it will demand one that has emotional or personal significance, though not necessarily your most cherished one. Complication: true names have power, but nicknames have their own, weaker power. The fiend is able to summon you to its infernal realm every so often, as per some backwards summoning spell. You appear as a ghostly form and can’t be permanently injured, though you may have to fight or undergo tasks. The fiend can’t torture you or hurt you willingly, but it can command you to perform duties as a summoned creature would.",
				"The fiend wants one fingernail from your non-dominant hand. It pulls them out with a pair of shiny, black pliers. The fingernail never grows back. Complication: that’s a really damn creepy thing to ask for. Why in the Nine Hells did they want a fingernail? What are they doing with it? Ugh. That’s gonna bother you.",
				"The fiend is drawn to the light that you spread — literally. If you are a spellcaster or other magic user, all of your magical effects get noticeably dimmer , though no harder to perceive i.e. this doesn’t change them to Subtle Spell. If you cast a spell that produces light as an intended effect (the Light cantrip, Daylight, Moonbeam, Sunburst, etc., though up to DM discretion), either the radius of light is lowered, or one damage die from the spell’s damage is demoted/removed entirely. If you’re a non-caster, your torches sputter and go out much faster than others’ do, and any magic items you use that are designed to cast light are reduced in radius.",
				"The fiend picks up a small rock off the ground and enchants it with a spell you cannot discern (on a successful Arcana check or casting of detect magic, you realize it’s from the Divination school). The fiend then demands that you always keep this rock on your person. You are magically bound to this: if the rock is left behind or discarded, it returns to your pack whenever you aren’t paying attention. The rock is always there and tends to get in the way, but imposes no mechanical penalties. Complication: The rock is a powerful scrying stone, and the fiend is able to watch you at any time, for as long as it wishes. Not only does the fiend enjoy spying on the Material Plane, but it has also been known to rent out the use of this rock to other fiends. Anyone who uses the rock cannot directly harm you or your companions…though nothing stops them from screwing with you in potentially terrible ways.",
				"The souls of your victims.",
				"A single drop of the PC’s blood. PC’s family was blessed by [Good being] generations ago for reasons. The [Evil being] than used their blood (couldn’t been taken, only given) in a ritual to weaken/torture/kill [Good being] and steal the item/person/prize/location they were guarding.",
				"Demon Only: The demon states that the player’s fee is waived, as the demon insert excuse here [likes them/is feeling generous/was or will be paid for doing the task/etc.]. As a token of the contract, the player must place a small scrap of moss in an obscure window frame, preferably in a ruin. The demon will attempt to deceive the player if asked about it, saying it’s a form of ritual in it’s ‘layer’ (means nothing in the abyss) to ensure a contract is completed. Complication: the scrap of moss is a fledgeling demon [if D&D, Alkilith from Mordenkainen’s Tome of Foes], and a portal to the Abyss. It can be recognized as fiendish by abilities or spells, and very few hit points. If left unchecked for d10 years, the moss will overgrow the window and open a gate to the Abyss.",
				"Act as an embassy to their side for XYZ ‘missions’/years. Example errand: Bring a box of junk to the hermit in an abandoned swamp cave as a personal present. The hermit was cursed centuries ago, locked away, stripped of all their power by a local shaman to wither and die. The hermit was a Hag Mother whose curse can only be broken by receiving an honest gift from a mortal (which would never happen under normal conditions due to her blood thrist and malice), which through proper coaching from the [Evil being], you’ve just broken.",
				"Wants your shadow. Without a shadow, being the negative space made by your presence in light, you are often forgotten about. Left out of stories, memories, often surprise people you are in the middle of conversations with when you speak even if you haven’t moved (‘OMG Gorgan, I didn’t see you there, dont sneak up on me like that’). Since you don’t seem to block light, you are often colder than normal and animals often don’t like to be in your presence.",
				"The PC will have to surrender the soul of their most beloved one. Wife, to child, to best friend. The Demon demands it for the contract to be fully bound. If the contract is broken, the soul is sent to the deepest depths of hell. But if the contract is completed to satisfaction, the soul is returned, after being exposed to hell for maybe a day to a week.",
				"A long term (read: perpetual) loan agreement. On the 6th day of the month, you must deposit a coinpurse with 66 gold pieces in it into a baroque ritual box. When closed, the box consumes the coins. Woe betide you should you come short on your payment. Mammon’s approach to debt restructuring is more cruel than any mortal moneylender.",
				"Your most precious memory and the memories required to make sense of it. Sets up for a great revealed twist in the PC’s own backstory.",
				"Your true name. The demon takes possession of your name, and can use it as a source of power over you. Whenever someone calls you by your true name you take 1d4 psychic damage.",
				"A small metal rod from the material plane. This is to serve as material component for Plane Shift to his other followers.",
				"The demon just wants a friend. No tricks, no gimmicks, they’ve just become so lonely that they’re willing to open up the possibility of having a mortal friend. They’ll check in with the player from time to time, ask how they’re doing, maybe even offer help or ask a favor of their own. (this one’s devious, because the player will constantly think and be waiting for an ulterior motive, and questioning somebody who actually just wants friendship).",
				"Just one eye. Turns out the eyes are the window to the soul, but the fiend only needs it cranked open halfway to see in. Giving up your eye tells the fiend your alignment, which in turn makes it easy for them to then exploit that knowledge to slowly bend you to their own alignment, so that when you die your soul goes to Hell/The Abyss and they can claim it as their own.",
				"Place a fist sized rock on a cobblestone bridge at exactly 9am tomorrow. Unknown to the player, a very important noble has fallen deathly ill and the cure will pass over the bridge on its way to the castle. The rock causes just enough of a delay that the noble dies, leaving their heir, a devote of said Demon/Devil in power.",
				"A wager: If the player dies in the next (X) days, the demon gets his or her soul. If the player manages to survive, the demon gets nothing. The demon cannot directly harm the player, but will do everything else within its power to see that the player meets an untimely end.",
				"Your thirdborn son. Whatever you were getting in the contract wasn’t worth a first or second born child.",
				"You must defile three holy sites of three different deities, the closer to Lawful Good the better. Preferably done by a less experienced demon/devil that uses brute force to gain influence instead of subjugation and trickery.",
				"The devil wants you to set him up in business. S/he will grant your boon in return for: a nice townhouse, endowed with sufficient capital that the maintenance and servants are paid in perpetuity; a shop in the poshest market square; the services for five years of a master in that trade (to teach it to the devil); an endowment for food, drink, etc., all top of the line; the tools, materials and capital sufficient for the trade; your enthusiastic marketing of his/her business; etc. This is a straight-up deal; the devil is sick of the politics of hell and just wants to live a mortal lifetime as a trader in [your pick, something fairly mundane, like tailor or mercer]. It’s gonna cost you way more gold than you might originally think, but you’ll get that boon fair and square. Now, the devil doesn’t intend to deal in souls, but business is business, and if something comes up that can be done subtly…",
				"The head of a well-known and beloved holy leader/monk whose God opposes the demon/devil.",
				"For you to carry a mysterious egg and protect it. Unknown to the players, the egg comes closer to hatching every time something dies within 30ft of it and players close to it gradually gain a small amount fire damage on their attacks. Egg can hatch into a physical form for the demon or a monster of your choice (friendly or not).",
				"Wants to watch you sleep and consume your dreams. Promises it will only take one night. But the next morning, the character finds that she remembers all her dreams… But her goals and motivations in life (which are another kind of ‘dreams’)? Those are gone. Forever. Character can develop other dreams (goals, motivations) but the ones that were taken can never be pursued again. Because the character simply doesn’t care about them anymore. This can be very broad. For example, if the character was especially greedy about loot and gold… well, that’s not the case anymore. Or limited to character specific quests only. The character doesn’t care about the mystery of who killed her parents, for example.",
				"The carcasses of 49 cats, to be delivered in a single bulk payment.",
				"Your Name: Your name is erased from your memory, and that of any who know you, and any written work, such as non-demonic contracts.",
				"Your lineage.",
				"Love – The fiend has either grown sentimental/nostalgic over a past life where he could love, or he simply wants to know what all the fuss is about. While you retain control, he experiences life through your heart and soul for one week. You can feel his presence and hear his whisper as he urges you to spend time with your loved ones, possibly threatening them if you don’t do as he says.",
				"Faith – The fiend tells you a secret truth that shakes your faith in a deity or ideal that you hold most valuable. You are cursed with never being able to speak it, or perhaps simply nobody believes you, but you know it to be true.",
				"Power – The fiend believes in equal exchange. If your contract is for political power, he takes your physical/magical power, and vice versa. The magnitude of the deal must remain equal on each side. If you can give him someone else’s power, that’s fine too, as the two signatories still ended up with a balanced deal.",
				"Gore – The fiend asks you to spill lots of blood for him. Not now, but over time. He just likes blood and guts, and now you’re starting to like it too. Everything you kill, you have an urge to mutilate, and every so often, you see the face of the fiend smiling up at you from a pool of blood.",
				"The devil challenges the claimant to a test of skill and talent. PC has 6 days to prepare for this contest in whatever way they see fit. On the day of the contest, they must beat an appropriate DC [50?] – if they succeed, they win, free and clear, a valuable prize thematically suited to skill tested- but if not, the devil gets the PC’s soul. PC’s party has a number of days/weeks/months to retrieve the claimant’s soul from the thematically appropriate hell before it is lost forever.",
				"For every favor you ask for from the demon, the demon takes 5% of your remaining life span. This doesn’t stack, it just continues to take 5% every time. If you have 70 years left, it takes 3.5 for the favor. If you used another favor immediately after that, it takes away 5% of the 66.5 years left remaining.",
				"The Demon/devil asks for the left shoe of every creature or person you kill. This is just for spite.",
				"The devil stores a soul in the character for safekeeping. This soul may occasionally force the player to commit evil acts. Later you can have a powerful warlock hunt the character intending to retrieve the soul.",
				"The character gets the halfling lucky trait but for a roll of 20 instead of 1. The fiend is siphoning their luck for unknown reasons.",
				"If the character ever verbally expresses love for another person, that person will be filled with hatred towards the character.",
				"A cult that worships the devil has been infiltrated by a holy paladin. The devil requests they find and kill this paladin before the devil is banished. (It is also to be assumed that this devil will provide reasonable assistance.)",
				"The devil brands the player with their symbol. That character is now sensitive to sunlight and vulnerable to radiant damage, any healing they receive from a good-aligned divine power is halved, good clerics might instinctively think the character is evil, etc.",
				"The character must mark every living creature they kill with the symbol of the devil they entered the contract with. After an hour the bodies are summoned to the devil who does what it pleases with the corpses.",
				"A cult worships the devil whose contract the character signs, and the devil asks the character to eradicate this cult. It turns out the cult was rather annoying and the devil just didn’t want to be summoned so often.",
				"The fiend needs four waterskins of blood from four specific creatures. The blood will be used to create a powerful ‘pet’ for the fiend which may or may not attack the character later on.",
				"The fiend asks that you irreparably break the trust of someone who is dear to you. Who’s trust you betray is up to you, but the fiend can tell by reading your soul whether the bond was strong or if the betrayal was true. The trust must be shattered irreversibly; if even a small amount of faith remains between you and your dear one, the fiend will not consider the condition met.",
				"The fiend insists on a request that has two parts. Firstly, you must capture the soul of someone you truly love and bring it to the fiend. The specific person or method of capture does not matter, just that they are important to you. Secondly, you must design a torment for the fiend that you believe would be the most excruciating for that particular person. The fiend expects you to use your knowledge of the person to assist you in your torture-crafting, and if it determines that you did not put your best effot into personalizing their eternal suffering, you fail the condition. If the fiend approves your torment, it sees to it that it is administered to the person’s soul for all eternity, leaving you and them mired in the knowledge that you are responsible for their everlasting pain.",
				"The fiend requests the soul of an innocent child from an enlightened race, personally slain by a sworn defender of the innocent. How the situation arose or how the soul is delivered do not matter; the fiend only cares that the circumstances set forth in its condition are met. The fiend may increase what it offers in exchange if you personally and purposefully create the circumstances that cause the slaying, with its pleasure deepening the more dramatic the conditions of the death.",
				"Your skill. The infernal takes one of your skill proficiencies (DMs choice). Not only does your skill drop to +0, but you are (meta-game) literally unable to ever pass that kind of skill check ever again. Any magical bonuses, additional modifiers, later level placements all become null.",
				"A part of your personal essence. Infernal takes from you a stat points.",
				"Your memories. Infernal takes from you all or specific memories from the PC. They choose memories specific to your character like “every memory of a loved one” so they are a stranger to you, where something specific is located like the magical mcguffin on their quest, a learned action such as a class power or magical spell (never able to be learned again), or for fun and games, basic knowledge like horses exists or that you cant breath underwater. MORE MALICIOUS VARIANT: The Infernal doesn’t care what memory they take, the whole contract was so that when they scan your memory for “which memory they want”, they actually get to see hidden information you wouldn’t have volunteered.",
				"A year of service.",
				"Your word of honor… Literally. You can no longer say the word honor.",
				"I demand your sword and shield, at a time of my choosing. This debt will be paid 3 times. So, mid fight, our plucky hero swings their mighty sword only to see it vanish before their eyes. As a member of a party, the protection of his allies is his shield and he watches them vanish too, off to fight some ancient foe of the Demon while he stands here unarmed against what was once an easy encounter…",
				"Perform a ritual (pour the blood of X) into the mouth of an aasimar (celestial souls are tasty).",
				"To learn the true name of another planar being.",
				"A child’s innocence. You needn’t give it to the demon, but you must take it away.",
				"The demon wants the ability to ‘sleep’. This demon lost its own ability to sleep in a different deal with another group of adventurers. You no longer need to sleep, but never truly feel ‘rested’. Should you ever have the need to go unconscious, you are semi-aware, just unable to move.",
				"The emotion in your voice. From now on, you speak in a monotone voice no matter your feelings.",
				"You must mildly inconvenience a specific person before a specific time, enough to delay them no less than 5 minutes. The demon may or may not inform you the target has a very important destiny they are unaware of, but hinges on them arriving at their destination before a specific time.",
				"You must enter a church and convince a specific clergyman to step outside the walls of the church, where the demon awaits.",
				"There’s an upcoming election and you must vote for or endorse the candidate of the demon’s choosing.",
				"The dying scream of a God. Good luck figuring out which one to kill … and then figuring out how to kill a god.",
				"You must gain the trust of an innocent, and then brutally break it. The demon doesn’t particularly need anything, he just wants to cause havoc.",
				"The fiend wants to see the material plane. In exchange for its favor, it gets to hitch a ride behind your eyes for a time. While it is there, you will trip any spell, ability, or creature that detects the presence of evil and/or fiends. You cannot enter holy sites whose alignment is not adjacent to that of the fiend. Further, it may be manipulating your dreams for its own purposes.",
				"An arm and a leg. They don’t care whose.",
				"You must aid a devil by infiltrating a church, temple or holy place with his minions. This will utterly and permanently corrupt the very foundation of an otherwise righteous institution.",
				"The fiend asks you to plant a black, spiny seed the size of a human thumb in the middle of a lush, green, verdant forest. Given d4 days to sprout, it will slowly begin to devour the local ecosystem as it grows into a massive knotted tangle of black, greasy vines with finger-length thorns. In d6 years, an area of roughly 3 square miles is converted into an Abyss-like landscape. All wildlife there becomes tainted and demonic, and demons frequently appear there.",
				"A weapon granted to you by the demon hungers for life; if you don’t use it to end a life twice per six days, the weapon turns on you and begins feasting on your flesh, dealing d10 damage and forcing a -3 penalty to STR and DEX on you until you kill something. A demon offering such a deal will almost always leave that part out.",
				"The demon grants you a magical pistol, and a satchel of seven magical bullets; the gun will only fire the seven bullets granted by the demon. The first six will instantly strike wherever the shooter aims, without fail; the first six ranged attacks made with this gun cannot miss, the gun will not jam, and the attack will always be a critical hit, as long as the magic bullets are used. The seventh shot, regardless of whether or not you use the demon’s bullets, will be controlled by the demon and will always strike where it wants, and will always be a critical hit.",
				"The devil requires that you kidnap a famous bard so that he may use the bard as his ‘ringer’ in a musical battle against a demon. The bard is also being pursued by the demon’s people, and has warded himself against any direct fiendish interference.",
				"Some of your experience. You loose your most recent level.",
				"A share in your success. Anytime you pick up any valuables (coins, gems, magical artifacts ect.) there is a 50% chance it goes to the demon.",
				"An arm and a leg. Luckily, they are generous enough to provide some old spares they don’t need. Replace one of your arms and legs with that of a random humanoid.",
				"To wear the face of your one true love.",
				"The knowledge of your favorite food. Nevermore will you taste it, nor remember the taste. Only the loss and the uncertainty remains: was this the food? Was this the way your mother made it?",
				"Asks to possess you for one day of your life. Given the choice of any day of your life, chooses the day you were born and changes your whole life.",
				"Make the demon something. Carve it from stone, or bone, or wood. Spend precious hours, stolen minutes, your sweat, your tears on the object. Make something more beautiful than you ever believed that your hands could craft. Burn it.",
				"Interrupt a wedding when the officiant asks if anyone has any objections. Use your imagination.",
				"Your brother/ sister / best friend’s favorite pet. Kill it. I don’t want the body. I just want to know that it is dead by your hand.",
				"Sit by the bedside of a dying man or woman, and tell them a bad joke. Make sure it’s the last thing they ever hear."
			]
		}
	]
}
