{
	"name": "Rumors",
	"category": "World Building",
	"source": "https://www.reddit.com/r/d100/comments/705bqp/d100_rumors_1/",
	"data": [
		{
			"name": "Rumor",
			"data": [
				"The brigands of the Ashen Waste have been turned into snakes by a wandering enchantress",
				"Ghosts walk the ramparts of the Tower of Ulfang the Black during the full moon",
				"Alil Yourner was killed by ghouls in the hills outside town",
				"An order of demonic cultists has re-opened the Forsaken Shrine of Mano the Crimson",
				"There are still many undiscovered chambers in the Caverns of Sinmardu",
				"The spiders of the Prison of Kas the Bloody are powerful spellcasters",
				"An iron golem has escaped from the tower of Saltesyas the Conjurer",
				"A pack of aberrant monsters prowls through the Amber Heath",
				"A ring of magical stone monoliths lies deep within the Trollcrags",
				"The king's guard have captured a mysterious red-robed assassin",
				"A band of orcs is in town looking for mercenary work",
				"The queen is a descendant of Muabura the Enchantress",
				"A ring of magical stone monoliths lies deep within the Shattered Lands",
				"An ancient sunken city lies somewhere beneath the Bene Heath",
				"A gang of thieves accidentally set fire to the Pantheon of the Astral Lords",
				"Warder the fletcher stole something from the Quartermasters Guild and then disappeared",
				"Ellyn was killed by orcs in the hills outside town",
				"Ghosts walk the ramparts of Modison's Hold during the full moon",
				"There is a secret entrance to the Secret Delve of Nightmares in the cellar beneath the Cursed Candle on Archer's Way",
				"The Temple of Angels is a front for the Thieves Guild",
				"The brigands of the March of the Broken Crown have been joined by a band of orcs and ogres",
				"A star has fallen into the Bede Fells",
				"Dainan's Delve is beseiged by the armies of the Wraith Princess",
				"A giant with a hundred arms dwells in the Marsh of Decay",
				"The chancellor of the treasury has been murdered by a red-robed assassin",
				"Agents of Sela have captured the king and replaced him with a doppelganger",
				"Hughye the bowyer has spent all his gold on alchemy and potions",
				"A caravan of merchants has discovered a lost city in the Paggeca Hills",
				"Scores of dragons have been gathering in the Anvil Hills",
				"The master of the Crossbowmen Guild has been murdered by a red-robed assassin",
				"A pack of flesh-eating ghouls lurks in the ruins of Gery Tower",
				"The town guards wear helmets to hide the horns on their heads",
				"The city of Cofield is besieged by demon-possessed goats",
				"The dragon Sumula has destroyed the city of Eacham",
				"The wizard Aches the Unearthly has disappeared, along with her collection of visions and prophecies",
				"Bizarre monsters have been encountered in the Frostwood Forest",
				"The innkeeper's daughter disappeared about when he got his new cat.",
				"Agents of the Vampire Empress have stolen an ancient artifact from the lost city of Kinbuzund in the Knifeblade Hills",
				"An iron golem has escaped from the tower of Odon the Artificer",
				"A star has fallen into Haven Island",
				"Brose has been spending strange coins, each bearing the image of a fanged skull",
				"An evil curse has befallen the elven city of Ellorlon",
				"A dwarven caravan is expected to arrive, carrying exotic weapons from the distant lands of Adech",
				"A fang demon with a thousand eyes has been summoned into the Nightfall Jungle",
				"A patrol of soldiers has discovered a lost city in the Bastion Downs",
				"Marger stole something from the Trapwrights Guild and then disappeared",
				"The master of the Diviners Guild has been murdered by a red-robed assassin",
				"Willan the calligrapher was killed by orcs in the hills outside town",
				"Lady Constie is dying of an incurable affliction",
				"Idel stole something from the Clockmakers Guild and then disappeared",
				"A spectral dragon has been seen in the Cairn Hills",
				"The bards of the Crossed Blades are actually assassins",
				"A patrol of soldiers has stumbled upon the secret temple of an ancient cult in the Aqtambori Jungle",
				"The town of Porthca has mysteriously disappeared",
				"Lady Aendent has been murdered by a red-robed assassin",
				"A perpetual storm rages over the Ceada Hills",
				"A spectral dragon has been seen in the Naver Woods",
				"A noble djinni is held imprisoned within the Lost Chambers of Annihilation, trapped behind a magical door with nine seals",
				"An undead knight in the ruins of Barad Ahil sometimes helps worthy adventurers",
				"Bizarre monsters have been encountered in the Kibuzund Crags",
				"There are still many undiscovered chambers in the Secret Dungeon of Secrets",
				"An elven princess is held captive within the Lost Tomb of Zeiram the Lich",
				"The bridge across the Iron River has been destroyed by brigands",
				"The Crossed Candles has mysteriously moved to the other side of town",
				"The wizard Lolesicl's toad is actually a polymorphed wizard",
				"The boss of the Butlers Guild is conspiring to overthrow the king",
				"A coven of cruel hags lurks in the ruins of Barad Enegor",
				"Aethed lost all his silver gambling at the Silver Shield",
				"An insane lich lurks in the ruins of Castow Castle",
				"Most of the town guards are evil cultists",
				"An undead knight in the ruins of Praham Stronghold holds a demon imprisoned for eternity",
				"Wine the woodcutter has been missing for days, and was last seen buying arms and armor from the market",
				"There are still many undiscovered chambers in the Secret Catacombs of Doom",
				"The dragon Amukar has destroyed the dwarven village of Rodiholm",
				"A deadly plague is spreading from the town of Catun",
				"A perpetual storm rages over the Grim Mountains",
				"The town of Tafeld has mysteriously disappeared",
				"The town was built on top of an ancient necropolis",
				"Anyone who kills a hundred rats is transformed into a goblin",
				"Agents of Shiva the Destroyer have slain the copper dragon which stood watch over the Forsaken Crypts of Ulfang the Black",
				"A group of pilgrims has unwittingly unleashed an evil curse in the Camonga Jungle",
				"Arcan was murdered by thieves in an alleyway near the Wicked Scoundrel",
				"Scores of dragons have been gathering in the Rampart Hills",
				"Someone has been looting tombs at the Shrine of Gardens",
				"The chancellor of the guilds is also the master of the Assassins Guild",
				"Werher was heard boasting that the reeve owes him a great debt",
				"A colossal ooze-like devil has been summoned into the Thunder Mountains",
				"The Clockmakers Guild is looking for mercenaries",
				"Cyne has been seen carrying bloody sacks Base Ditch",
				"An ancient weapon of the gods lies somewhere within the Secret Shrine of Lord Greywulf",
				"The avatar of a God of Good is held captive within the Sepulcher of Infernal Necromancy, charmed by a seductive devil",
				"A spectral dragon has been seen in the Witta Bluffs",
				"A group of pilgrims has uncovered a terrible secret in the Nala Highlands",
				"Wigre the barber was heard boasting that he has stolen magical boots which allow him to walk through walls",
				"The boss of the Thieves Guild has been murdered by a red-robed assassin",
				"The legendary hero Vyncent Hopyc is held captive within the Dread Halls of the Wraith King, trapped at the center of a shifting labyrinth",
				"The illustrious archmage Clesiusil is held imprisoned within the Labyrinth of Suatriusa, trapped at the center of a shifting labyrinth",
				"The cat at the Crimson Chariot is actually a polymorphed prince",
				"The stone gargoyles of the Fortress of Adabuh come to life at night",
				"The avatar of a Goddess of Death is held imprisoned within the Lost Hive of Ages, entombed at the heart of a massive crystal",
				"I once saw Gornak the Brave pick up the tavern and spin it around on the tip of his finger! When he set it back down and walked inside, he hadn't even spilled his beer.",
				"You ever heard of the man named miryks? He was the only man to have ever bedded a dragon, and then he bedded three more!",
				"You ever hear of Ogrub the ogre? It's said that a magical artifact gave him a moral compass and he helped save a whole village, kept them all from drowning during the dam break, then he settled down as a farmer there for awhile. No one knows what happened to him after that.",
				"You ever heard of Fizziks the wealthiest goblin to ever live? It's said that he made his fortune following adventurers around and sneaking into the dungeons after they come back out, claiming anything valuable left behind. He supposedly has a knack for finding hidden doors and picking locks, and would find all kind of stuff stashed away that was missed.",
				"Ever heard about the dwarf-eating forest? I heard that the dwarves cut and chopped some roots under that region, not realizing it was still a live tree, and now any dwarf who happens in that forest is never seen again.",
				"They say Marcol Giantsteppe built the mountains out of dragon bones to protect our little town.",
				"The Legend(s) of Kiven, Stupidest Man in All the Land. Once walked out of an inn and was unable to find his way back... Even from within sight of the inn itself. He drank an entire bottle of ink and promptly vomited. Did it again the next day. Learned the Shocking Grasp cantrip... and tested it on himself. He stole a Sending Stone from a fellow adventurer, and tried to sell it back to him. He frequently confuses cats for dogs, and vice versa.",
				"Have you heard the tail of Uthall Twice-Orphaned Thunukalathi? He was a Goliath who beat a storm giant in a wrestling match, and then proceeded to beat an empyrean in a body building contest.",
				"A long time ago, there was a gnoll woman named Cisathaka. She rejected her demonic heritage and entered an halfling beauty pageant, and won. She donated all the prize money to a struggling orphanage in (insert city name from the setting here).",
				"Ever heard of grüngle the filthy? He stunk so much that he once caused a rust monster to dissolve with a single breath.",
				"Just read the book “Praise the Great Beholder!”. It’s about Chezdrur the beholder, a flawless character who ends up easily killing the tarrasque in a great battle. It was written by a cult who worships Chezdrur, who is real but hasn’t even seen the tarrasque from afar.",
				"One winter it was so cold that the dawn froze solid. The sun normally rose between two mountains, but the ice had built up so much that it stuck firmly in place. The first sunbeams of the day had frozen up like golden icicles. A ranger named Dav Oket was coming home from a successful night hunting with a fresh owlbear. Seeing the sun frozen in place, and being a smart man, Dav knew he had to do something quickly or the world would plunge into chaos. He swiftly sprinted up the frozen sunbeams and used the heat of the owlbear carcass to melt the ice. Dav gave the sun a kick to dislodge it, lit his pipe on the sun, and slid down the sunbeams with the owlbear right to his front door. He even kept a bit of the sunrise in his pocket to remember the occasion.",
				"If you travel to Owlbear Lake on a quiet day, you might just catch a glimpse of The Monster. It looks like a great brown snake 90 feet long, with two huge ears coming out the sides of its head and jaws large enough to swallow a man in one gulp! Some say it has hundreds of small legs that make it kind of skitter across the ground, but it can swim faster than a horse can gallop. Sometimes it sneaks up on swimmers, and if it's not hungry it just pulls them under and lets them go. Of course old Dav Oket heard about this monster and bet his friends that he could take it on. After days of stalking, Dav finally had a shot with his bow. He was a crack shot, but not an arrow found its mark. The Monster scuttled forward and ate Dav's bow! So the ranger wrapped his arms around the beast and wrestled with it. The fight was so great, so colossal, that it stirred up a storm over the lake. Finally, Dav threw the Monster over his shoulder, and it sailed right over the mountain. To this day, you can cross the lake in safety if you call out, \"Old Dav's a-coming!\" and the Monster swims away to the bottom of the lake.",
				"Lady of Pain! The lady who had so many piercings and self inflicted curses she rattled and smoked with every movement.",
				"Have you heard the story of the great blind sorcerer? Prince of an elven kingdom, he killed three gods as a child and that was before he learned magic!",
				"You haven't heard of Kim the Great and his stories? It is said that at the age of 9 he had slain a dragon alone to protect the people of his land, with his bare hands, using no magic. Out Great Leader Kim truly is a gift from the gods",
				"Ebrius \"the drunk\" once drank the entire ocean after his ale fell in it. Impressed by his resolution the gods proclaimed him the \"Lord of the drunkards\". It's true, you can ask him yourself, he's probably in the tavern right now. (Just has a godlike bluff, advantage if the person he's talking to is drunk too).",
				"Centuries ago, there was a dark mage, Daffy, the Implacable. He summoned another moon, and named it Majorus. It was going to fall on the world, and destroy all of it, but it turned out the \"moon\" was just too close, making it seem big. So, a group of adventurers threw fireballs at it, and Majorus burned down. Daffy was never seen again.",
				"There once was a boy, called Brightus. It's said he made a heavier-than-air machine, that could fly without magic. He rode what was called \"The Airplane\" out of a cliff, as a crowd watched him fly it into the unknown. Legend says Brightus will one day return, giving flying machines to everyone.",
				"It's said the Great King (intentionaly vague) had a younger brother, who wanted to take the crown at all costs. So, he made deals with several demons, and got enough power to kill everyone but his brother in the kingdom, replace them with minions, and get rid of all the evidence. Legend has it the original King was magically paralysed and made invisible before all that happened, and had to watch as his brother destroyed everything and took his identity.",
				"There once was a deaf woman with a ridiculous name. So ridiculous, in fact, that whoever heard it laughed to death. She caused death everywhere he went, and eventually got her hearing defficiency cured by an also deaf cleric. So, she heard her name, and laughed to death.",
				"Ever hear the tale of Rutmod the Sunderer? Legend says Rutmod won two dozen rounds of gladitorial combat, and severed the arms of every single combatant that fought that day. The strangest part is, he started with his own!",
				"Legend tells of a man by the name of Throckmorton, who would only traverse the land on a board with several small wheels attached to it. He would flip this board around in a dizzying display of finesse, and could propel himself faster than any sprinter. No man or beast could touch him. One day, Throckmorton grew bored of this plane, and propelled off of a ramp upwards into the heavens themselves, where he performs his tricks to this day.",
				"Before the ancients took hold in the land there was a legend that defied the rules of logic. Its said that in The Ethereal Highlands there lived a young lady named Megaera. Rumor has it that she was raised by clan of giants who had never seen a human before. One day, Megaera wondered too far away from the giants encampment, and entered the dark forest. Megaera sent several days lost in the woods afraid and starving. There was dragon larking in the shadows then suddenly it flow out of the darkness penning Megaera to the ground. Hopelessness dawned on Megaera as the dragon opened its jaws ready for a fest. The dragon's piercing teeth bit into Megaera as she was eaten alive, screams began to go numb the fur down she went into its stomach. Death was assured for Megaera. Then something happened, the dragon began to roar violently in pain. Megeare was more than a mer mortal, she was the offspring of t Eztia, Goddess Of Destiny. Megaera short ripped the dragon a part from the inside out, however, she left the wings intacted so she could meld with them in order to fly into the heavens.",
				"Have you heard the tale of Nublig the goblin chronomancer? Long story short he was his own grandfather.",
				"Long ago there was an Elf and a Dwarf who competed at everything to see who was better. One day they asked a Druid to turn them both into trees to see who was the better tree and the Druid obliged. The Elf became a tall elegant oak and the Dwarf became a tiny fir tree, however, since neither could speak to request to be changed back they became stuck that way. They propagated and now there are short sturdy pine trees all over the Dwarf mountains and tall oaks throughout the Elven kingdoms.",
				"The first globe map was created when a Beholder flew up enough to see the entire world and then lost his eye on the way down.",
				"There was once a love so strong between two people that if you stood between them one side of you would feel ice, and the other straight fire.",
				"The giant threw the rock with such strength that the rock made a roundabout and hit him in the back killing him. When his friend came to see what left a big hole in the giants head, he too got a stone blowing his head up.",
				"The tribes of kzechem sacrifice their people at the same spot. This has been a tradition for thousands of years.",
				"Tarrasques are so big that their white blood cells fell of and became coconuts. Their red blood cells then became strawberries.",
				"Thrain was so strong already at birth that when a deadly plague came to kill him and his family, he tore apart the evil spirit with his little baby hands. Saving his kingdom.",
				"And then the Goliath swung his great sword at the king's head. He cleaved with such a fierce blow the head went flying. It flew for miles, falling into a rabbit hole. That's how we came up with golf.",
				"According to eyewitnesses the king of the elves was seen on a shield, going downwards on a slope filled with dead bodies, He then turned with his beautiful archery skills the hill/mountain into a bloodied one. That's why this is called blood slope/blood mountain.",
				"Have you heard of Billy Punchyface, the ratfolk who once knocked out an orc twice his size? Granted, that wasn't a very big orc, but still!",
				"The local lord has a harem of sex slaves.",
				"A nearby cave was a hiding spot for a now dead thief.",
				"Increased undead activity in the (pick direction).",
				"(Major city) is sending troops to (minor city) to quell rebellion.",
				"A local woman had a baby with horns.",
				"The local government is adding something to the ale to keep people placid.",
				"A chicken that ran off into the woods lays golden eggs.",
				"A traveler that was at the pub a few days ago got drunk and turned into a monster before running off.",
				"Things have been going missing.",
				"Weird sounds have been coming out of the well.",
				"A war has erupted between (pick two cities or countries).",
				"Drew have been sneaking into town at night and killing people in their sleep.",
				"The king has been disguising himself as a commoner and walking about.",
				"There is a talking horse in the stable, but he is shy.",
				"A giant monster lives in the forest.",
				"A dragon lives in a nearby cave.",
				"A god lives in this town.",
				"(2 nobles) are secretly having a love affair.",
				"A local merchant is minting his own coins.",
				"A local woman is possessed by a demon.",
				"The king is sending a wagon full of gold to help the people of this town.",
				"A wizard lives in a secret cave under the town experimenting on people.",
				"The guard captain is taking “protection” money from local merchants.",
				"The lord of the town is a (doppelganger, mindflayer, vampire, etc)",
				"Most of the people in the town are dragons in human form.",
				"A group of adventurers saved the princess from (insert monster).",
				"The trees outside of town are alive.",
				"The water in (neighboring town) was poisoned.",
				"The local inn is haunted.",
				"A home inside this town has a cult that worships an evil deity.",
				"A famous bard is supposed to be visiting this town soon.",
				"A circus is on its way to town.",
				"A band of barbarians is on its way to town.",
				"This winter is supposed to be extremely cold.",
				"All the crops in (city or town) died overnight.",
				"The water in (city or town) turned black.",
				"Rumor about parties last adventure.",
				"A local has hooves instead of feet.",
				"Shadows wander the streets at night.",
				"A local house is haunted.",
				"Mikela’s husband was killed by her lover.",
				"This city was built on a burial ground for orcs.",
				"There are tunnels beneath the city built by (dwarves, drow, gnomes, etc).",
				"The city was built on the ruins of an older city.",
				"A library of magic tomes is hidden in the city.",
				"Giant ants live in tunnels under the city.",
				"A circle of druids meet in a grove at night outside the city.",
				"An old temple to the (direction) was abandoned and still holds all its treasures.",
				"A treasure map to a powerful magical sword is hidden by (merchant).",
				"A group of orcs have been raiding villages.",
				"Giants have been seen outside of town.",
				"A man killed a horde of goblins single handed.",
				"Wilson obviously is in love with Kelly. Why don’t they just admit it and go out together already.",
				"The lord of the town has enchanted roaches that spy on the people of the town.",
				"There is a storm coming.",
				"A wizard has created an intelligent golem.",
				"A group of adventurers have found ruins to the (direction) that have been untouched for a 1000 years.",
				"A group of adventurers have saved a town to the (direction) from a horde of undead.",
				"A king was assassinated and replaced by his evil brother.",
				"(Town or city) had an exceptional harvest this year.",
				"The cook at the inn spits in the food.",
				"The bartender cheats on his wife with the wenches.",
				"The kids in this town are being mind controlled and are trying to take over.",
				"The Tarrasque was seen in the forest outside town.",
				"A creature with the head of a bear and the body of a mountain lion, with human eyes, walking upright, came into my room last night and stole my chamber pot.",
				"(Drunk) Thish town hash a horde of mens that are 1 incsh big that steal your booshts whilst you shleep.",
				"The seamstress, the one that looks like a pig, will give you a big discount if you flirt with her.  ",
				"There is a magical tree in the forest with golden bark that grants wishes.",
				"The other tavern in town has watered down beer and uses scraps from the butcher to make their stew.",
				"The guards in town drink a potion in the morning to make them unnaturally strong.",
				"Beholders have taken control of the king.",
				"The seas have been swallowing ships.",
				"A (tidal wave, hurricane, earthquake, etc) has destroyed much of (city).",
				"The nobility have been secretly warring in (city).",
				"Swarms of locusts have been seen heading this way.",
				"The guards here take bribes for almost anything. They will even turn a blind eye to murder for the right price.",
				"A gem the size of my fist was found in a cave to the (direction).",
				"The lord in this town puts something in the water that makes you not be able to have children.",
				"The lord of this town puts something in the water that makes ya sit in the outhouse for hours.",
				"The wheat fields have creatures that come out at night and will kill anyone who wanders at night.",
				"The guards in this town don’t pay for their meals.",
				"My best friend said his sister’s boyfriend told her that her mother’s uncle was a king's jester.",
				"The local wine is made from the blood of humans.",
				"Tiny bugs crawl into our ears at night and listen to our thoughts then go in the morning to tell the lord what we are thinking.",
				"I am not responsible for my actions. I am being controlled by a demon! (Attacks)",
				"The patron stands and looks at the questioner. “How dare you ask me that!” And throws their drink in the person's face.",
				"The blacksmith has a dwarf chained in his basement who makes all his stuff.",
				"A naked woman wanders the forest at night seeking men to kill.",
				"A powerful lich has taken over the city and wants to make us all part of his undead army.",
				"(City) has closed its gates to all outsiders. No one is allowed in or out.",
				"The temple of (deity) was burned down by heretics.",
				"(Deity) was seen fighting with the army from (city).",
				"Gerald is not a bad person.  He didn’t mean to kill all those people and it’s not his fault he was that hungry.",
				"(Incoherent babbling) big… teeth…. heart… (add words that fit to your adventure)",
				"Brownies have been gathering outside the city. ",
				"The road ahead is clear and you should be on it as soon as you are able.",
				"For the right amount of silver there is much I can remember. (Reroll)",
				"A man was found outside the city with his ears, nose, and toes missing.",
				"I heard that the leather worker dances by a fire at night dressed in the skin of other men."
			]
		}
	]
}
