{
	"name": "Wild Cooking Encounters",
	"category": "Encounters",
	"source": "https://www.reddit.com/r/DnD/comments/8ajhb9/d100_wild_cooking_table/",
	"data": [
		{
			"name": "Cooking Encounter",
			"data": [
				"Overcooked beans make digestion difficult. The party takes -5 to Stealth rolls for the next 12 hours",
				"You eat a mystical, massive pretzel, and are unable to get drunk for 12 days",
				"A cloudy tomato soup Misty Steps all party members its maximum range in a random direction",
				"Everyone eating your delicious meal gains 4d10 hit points",
				"You brew a particularly potent pot of coffee and your hands shake from the caffeine. The party takes a -2 to all ranged attacks for the next 8 hours.",
				"You enter a cooking trance so intense that you grow a third arm for five minutes to help you prepare. You create two meals for each member of the party, and the meals will never spoil",
				"A sentient corn muffin eats the weapon closest to the cooking fire",
				"The cast-aside bones of your chicken spring to life. A \"Skeleton\" spawns, and attacks you immediately",
				"You experiment with making a lizard kabob. The lizard vanishes, but you hear a voice whisper the name of the nearest dragon",
				"A piece of metal breaks into the hash browns. Roll an Investigation check (DC 15). Failure causes 4d6 piercing damage to a random party member",
				"Your ineptitude angers some higher being. Your hands are covered in unidentifiable goo for one hour, making it impossible to hold a weapon",
				"The meal agrees with no one. You cast Stinking Cloud, centered on yourself, for 15 minutes",
				"When preparing to cook, you wish into existence the meat of any creature or humanoid you've seen before. The meat appears in a portion just large enough to cook into meat pies for the party",
				"You forget to tenderize the owlbear meat. Everyone in the party takes one point of exhaustion from chewing",
				"The soufflé deflates, as do your hopes and dreams. The DM receives 1d10 de-inspiration die to use against you for any skill check",
				"You begin making a rum cake. You finish the cake, but are now also drunk",
				"The compost from your meal inspires plants nearby to grow at double speed",
				"A bit of pixie dust falls into the stew. The next time you fight a group of Fey creatures they will all have advantage on their first attack against the party",
				"Overfull, the party makes a collective sloshing sound as they walk for the next fifteen minutes",
				"A strong blueberry turns your lips blue for 1d4 days",
				"A hand-washing incident poisons the food. Every player's Constitution is 5 for the next twenty minutes.",
				"A mysterious hour glass appears on the cook preparation area",
				"The noxious smell of your foul supper attracts a pack of Wolves (1d6 + average party level)",
				"One of the quails you were defeathering comes back to life and tells you what the weather will be for the next week before flying off",
				"You roll 1d4. You lose that many toes to a knife-dropping accident",
				"You create a perfectly-balanced buffalo sauce that clears out the sinuses of every party member. For one day they have advantage on Perception checks that involve smell",
				"You so thoroughly sear a piece of meat that the oozing liquids start a grease fire",
				"You shout at your pan in frustration, causing it to glow white hot. You must make a Charisma check (DC 15) to apologize or be teleported to the slave market in the City of Brass on the Fire Plane for 1 minute",
				"You position the fire wood in a precarious pentagram and summon a CR 2 demon, devil, or infernal, which attacks you immediately",
				"You sear a steak fit for an emperor. The meat will never spoil, and can be presented to any titled royalty to give you advantage in any Persuasion roll against them",
				"You stomp the ground in frustration, awakening a minor deity beneath the soil. 4d10 oranges fall from the closest tree",
				"You leave the sauce pan on the fire for too long. The food is burnt, entirely inedible, and you must discard two days worth of rations",
				"You mistake the gunpowder bag for ground black pepper (again). Seasoning your steaks causes a 3d10 Fireball to erupt, centered on you",
				"All of your knives begin to sharpen themselves. You gain +2 to Cooking Utensil checks for the next 1d4 weeks",
				"You bake a cupcake of unparalleled symmetry, that you can give to the player of your choice. The next time that player drops to 0 hit points, they are immediately healed for 10 hit points and return to their feet",
				"A random player grows a full, thick beard, consistent with their current hair color",
				"The patron gods of all Clerics, Paladins, and Warlocks in the party appear to grab a plate of your meal, and then vanish without a word",
				"You mistake your knife for saucepan, your pot for tongs, and your spatula for mortar and pestle. No meal gets made",
				"You cure an uniquely resilient stick of beef jerky. A Barbarian who eats the jerky can Rage once for free",
				"The smoke from your sautéed onions comes imbued with magic, and points you toward the nearest town",
				"A random character's pants become too tight to wear for the next two hours",
				"You receive a map indicating the location of a legendary cooking implement, whose stats and location are to be determined by the DM",
				"You cook a fine meal. The party takes no notice of your craftsmanship, but they eat it without complaint",
				"Finding a hair in their salad, a random character becomes frightened of the color green for one hour.",
				"You idly play drums on your cooking pan with some forks. An ally nearby receives a 1d10 inspiration die",
				"You prepare an odd, bulbous root. Everyone's urine turns purple for 1d4 days",
				"You grow a third eye on your forehead that acts as a Beholder's main eye, casting an anti-magic cone in front of you for one day",
				"You enter a frenzied cooking trance, unable to control your own actions. In the course of 20 minutes, you accidentally prepare a Hero's Feast (see PHB 250)",
				"While cooking your mind is distracted by your current obligation, which is noticed by the god of tricks. If you are hunting a particular enemy, that enemy appears somewhere within 300 ft of the camp and is immediately considered Stealthed",
				"A dark chocolate magma cake inspires the party. An aura of True Darkness (5ft. Radius) surrounds each party member for a half hour",
				"Your cooking pleases the earth around you. A grove of resilient oak trees begin to grow under your feet, no matter what terrain you're currently in",
				"The image of pockmarked chicken skin forces a random character to relive a horrific memory. They are sexually incapable for the next month",
				"An imp casts a mysterious spell onto a serving of mashed potatoes. One random player forgets how to read, and must relearn.",
				"One of the party's tankards falls into the boiling stew. When you take it out, you see that it's not hot, and is unable to spill its contents unless you ask it to",
				"No one understands your culinary brilliance. You refuse to cook for the day, and gain one point of Inspiration for sticking up for yourself",
				"You think to add gold flecks to the wine to give it a sense of decorum. You lose 1 GP, but each party member vomits 1d12 GP",
				"You trigger an Iron Chef cook-off. All party members present must roll Cooking Utensil skill checks, and the winner receives 1d20 gold from each loser",
				"An erratic series of movements accidentally opens a portal to the Abyss. Your cooking utensils are sucked through to the other side",
				"An immaculate blue lobster wanders into your grasp. Anyone eating from a meal containing the lobster is satiated of food for two days",
				"Deboning a fish, you become enlightened as to the anatomy of the human form. Each of your melee attacks in the next 24 hours does an extra 1d4 damage",
				"Your pork chops cause a random party member to question their decisions. The DM randomly selects a character, and that party member's alignment shifts down one slot (Good to Neutral or Neutral to Evil)",
				"You brew a particularly potent pot of coffee and everyone's senses sharpen. The party is unable to be ambushed or surprised for the next 8 hours",
				"You crack an egg that, instead of a yolk, contains an anti-magic blast. All magical items within 100 feet are disabled for one hour",
				"You brew a lemonade so sour that the party must make a Constitution saving throw (DC 10). If they succeed, they are resistant to poison for the next 4 hours",
				"A bowl of chili ceases to smoke. Anyone who inhales the smoke purposefully automatically crits on any Investigation check for the next thirty minutes. No party member other than the cook can be told of this effect.",
				"You mistake a Carolina Reaper pepper for a simple red bell pepper. Smoke emanates from your party's ears for 10 minutes, and they are at disadvantage when attacking",
				"You attempt a curious mixture of sugar, milk, and cocoa. You create 2d12 candies that will never spoil and can be sold for 1d4 GP a piece",
				"The post-meal tea leaves form omens in the bottom of every player's cup. The DM must inform the party if they are currently being followed, watched, scryed upon, or noticed in any way",
				"A difficult stuffed mushroom rolls onto the ground. You roll with it, and your actions are tied to its movement for the next hour",
				"In an attempt to make beef gravy, you instead brew a Potion of Haste",
				"An attempt at hollandaise changes the party. Each player must roll 1d8 and change their alignment accordingly (with no change for True Neutral) with 1 in the top left (Lawful Good) and 8 in the bottom right (Chaotic Evil)",
				"You create deviled eggs so divine that you are given a glimpse of Chronias in the Seven Heavens. You become blind for one hour, but are unable to be Exhausted for a week",
				"A horse hoof from your most recent butchering trip begins to petrify into a strange metal. You can have a blacksmith attempt to add it to any martial weapon to add a +1 to hit",
				"All party members experience rapid fingernail growth, and must cut them every twelve hours for the next 1d4 days",
				"You find an old and unusually large fruitcake in your bag. The party eats for free for one day.",
				"You leave the bread dough to sit for too long, causing it to ferment. The party is considered Poisoned for one minute or must make a Constitution check (DC 15) to forcefully vomit",
				"Grinding an herb you found on the ground causes your meal to glow with an earthy aura. A random Fey creature is teleported to you, and acts accordingly",
				"Your portable tankards offend the gods. You are berated by higher powers from above for ten minutes",
				"All relevant party members regain their unique ability charges (Druids - Beast Form, Barbarians - Rage, Sorcerers - Sorcery Points, Monks - Ki Points, Bards - Inspirations)",
				"You create an anti-meal, casting Blight on the party. Roll another Cooking Utensil skill check +5 to act as the DC for the party's Constitution Save",
				"Biscuits equal to the number of players come out of the oven with strange sigils imprinted on the top. Anyone who eats a biscuit can Fly for 5 minutes",
				"You cook the wrong type of mushroom. The party sees colors but not shapes for the next four hours, and cannot sleep",
				"Your fish and chips come out perfectly. Any player with a connection to the sea doubles their proficiency modifier for the next 24 hours",
				"Your pots and pans spring to life, and sing a song about the guest-host relationship. Each party member receives one point of Inspiration",
				"You assemble an unusually enticing salad. A herd of random woodland creatures flock to your kitchen.",
				"A salami stromboli shows the adventurers the meaning of life. They are able to see all Invisible creatures or humanoids around them for the next two hours",
				"The milk has gone bad. All characters must make a Constitution Saving throw (DC 13). Those who succeed can eat without incident. Failure makes that player skip a meal",
				"You pour some win onto the pan to create a miraculous flame effect. You lose both eyebrows in the process, and can grow them back over the next month",
				"Your clam chowder enrages the sea gods. 2d100 Crabs spill out of your pot",
				"Your idle movements in stirring chopped peppers in the pan creates a teleportation sigil. An ally priest is summoned to your location",
				"You make an \"oregano\" mistake. The party takes one point of exhaustion, but becomes relatively stress-free for the next four hours",
				"On the ground you find a small box of Unending Salt.",
				"The next time any Bard who has eaten from this meal inspires someone the target has the option to have an inspirational quote appear as a tattoo on their skin",
				"Your tongs snap back. Take 2d4 piercing damage",
				"No party member can resist your meal, and demand a repeat. Roll another Cooking Utensil check (DC 15) to attempt to make it again. Failure evokes 1d6 psychic damage from your disappointment",
				"You run out of ingredients and use local flora and fauna instead. Roll 1d4. With a roll of 1, your party is Poisoned for one minute",
				"Any cleric eating from your meal receives a one-time 1d10 to their Divine Intervention roll. They can use this to add to or subtract from their initial percentile roll",
				"Your attempt at drying out some raisins creates instead two greater healing potions",
				"You experiment with making a lizard kabob. You succeed, but the dragon closest to your location is told your name",
				"You make a fine blue cheese dressing. The party smells of lemons for the next week"
			]
		}
	]
}