{
	"name": "Body Search Complications",
	"category": "Encounters",
	"source": "https://archonsmarchon.blogspot.com/2018/11/d100-i-search-body-complications.html",
	"data": [
		{
			"name": "Complication",
			"data": [
				"They’re still alive, just barely.",
				"It’s undead and playing dead, waiting for one of the living to come by to attack.",
				"It’s carrying a contagious disease.",
				"It’s been covered in glue.",
				"It’s a lifelike mannequin.",
				"On closer inspection it looks exactly like you.",
				"It’s boobytrapped with explosives.",
				"The coins in its pocket weren’t minted with any known metal.",
				"It’s being used as a lure by a cunning predator.",
				"Their friends are looking for them and they won’t take kindly to looters.",
				"It’s someone famous.",
				"There’s no apparent cause of death.",
				"The body’s already been looted.",
				"Someone has stripped the body and replaced everything it was wearing and carrying with other stuff.",
				"The body is floppy and has no bones.",
				"It’s been covered in flammable oil.",
				"Everything they’re carrying is a convincing but less valuable counterfeit.",
				"Everything they’re carrying is of high quality and more valuable than other similar items.",
				"They’ve got a bounty on their head. If you bring their head in you can collect the bounty.",
				"They’re still alive and in good health, but are practicing for a role as a dead body in a play.",
				"Something’s removed its teeth and fingertips.",
				"A vicious parasite has been incubating in its guts and will emerge and attack if the body’s disturbed.",
				"All the body’s valuables have been stuffed down its throat.",
				"It immediately decays to a late stage of decomposition when touched.",
				"It smells terrible and the smell will cling to you for hours after you touch it.",
				"A swarm of small scavengers are eating it.",
				"There is a wind-up key in their back. If turned they’ll return to life.",
				"The first person to touch them will have a vision of how they died.",
				"It’s got no face.",
				"Something has decapitated it and stitched on someone else’s head.",
				"Some of its organs have been surgically removed.",
				"Anyone who loots the body will be haunted by its ghost.",
				"The words: “TRESPASSERS BEWARE” have been carved into the body.",
				"The body’s been implanted with galvanic wiring that make it twitch and grab when touched. The wiring is worth 10 silver if stripped out, and is a good conductor.",
				"The body smells irresistibly delicious. Save vs. magic to not take a bite if you don’t immediately back off.",
				"The body’s been enchanted to repeat a speech promising a reward to the person who finds the one who killed them.",
				"The body is a glamour, and so is everything it carries. One hour after being found, it’ll all disappear.",
				"The body has an important political message tattooed on it. Some of the message has been flayed off.",
				"The body’s cause of death is implausibly incongruent with its environment.",
				"They’re still alive, and conducting a sting operation on necrophiliacs.",
				"The body’s hand is pointed towards a secret door or compartment.",
				"The body’s on top of the pressure plate of a trap.",
				"The body is unnaturally, painfully cold to the touch.",
				"The body’s anatomy is subtly wrong.",
				"The body shrivels and shrinks every time it’s touched.",
				"The body bloats and swells every time it’s touched. 1-in-6 chance each time it bursts in a flood of putrescence.",
				"One of the items it’s carrying is cursed to induce a deathlike stupour. When removed from the body it will spring back to life and the looter will fall unconscious.",
				"One of the body’s fingers has been carved down to the bone into a key. It unlocks something nearby.",
				"The body is being used as a test by a very dumb goblin hiding nearby to learn what’s worth looting from a corpse.",
				"They are several smaller corpses posed in the same outfit to look like a larger corpse.",
				"It’s been embalmed. The embalming materials are quite valuable if extracted.",
				"Makeup has been applied to the body to make it look fresher.",
				"The body’s been enchanted to pronounce a curse on looters.",
				"It bears a familial resemblance to someone you’ve met.",
				"It changes in appearance every time you look away.",
				"If you loot it it’ll appear next to you the next time you sleep.",
				"It’s a mimic posing as a corpse.",
				"The body bears the marks of necromancy and will rise as one of the undead unless blessed, or dismembered or otherwise destroyed.",
				"The body appears to be swiftly decomposing in reverse.",
				"They’re still alive, and are hunting ghouls using themself as bait. They’ll start off assuming anyone touching them is a ghoul.",
				"The body has a magic diary that records everything that happens to and around it.",
				"The body has been seasoned with expensive spices.",
				"The body’s skin has been tanned into leather while it’s still attached.",
				"The body’s eyes follow you and never blink.",
				"The body’s weirdly heavy.",
				"Decomposers and scavengers haven’t and won’t touch the body.",
				"If you loot the body it will become a recurring figure in your dreams until you sell off the loot.",
				"The body’s been dusted with mutagenic spores.",
				"The body’s loyal pet viper guards it still from inside a pocket.",
				"A faulty Speak With Dead spell was cast on the body. If touched it’ll scream its life story until its vocal chords rupture.",
				"The body’s been smeared with poisonous slime.",
				"Any coins the body carries are stamped with its own face.",
				"Any coins the body carries have been amateurishly clipped.",
				"The body’s face is frozen in a paroxysm of fear, and its hair is still standing on end.",
				"The body is that of a missing person, and there is a reward on offer for news of their fate.",
				"The body falls apart along invisible seams when touched.",
				"It’s an unusual zombie which will imprint on and obey the first person to touch it.",
				"When touched its flesh will slough off its bones.",
				"On closer examination the body’s clothes are organic parts of it.",
				"They’re still alive and are taking a nap.",
				"The body is currently under clairvoyant observation by a self-righteous wizard.",
				"The body, the floor it’s lying on, and its belongings have all partially fused together, and must be cut apart if they are to be retrieved.",
				"The body’s blood has been replaced with imperishable honey. This is quite valuable if drained, and could also be used as an encumbrance-efficient ration.",
				"The body is slowly being carried away by ants.",
				"The body’s possessions are wildly anachronistic.",
				"The body is only dead while observed (seen, heard, smelled, etc.). When unobserved, they return to life.",
				"Its brain has been messily slurped out one ear.",
				"The wealth it’s carrying was stolen from someone dangerous who wants it all back.",
				"The body is a hollow skin that collapses when touched.",
				"The body has been colonized by an intelligent fungus that intends to use it as a vessel to communicate with and go about humanity.",
				"They bore a supernatural debt which will fall on the first person to touch their body.",
				"The body is not dead, but metamorphosing.",
				"The body has many minor wounds, and one will transfer to the person who touches them or takes one of their possessions each time they do so.",
				"It’s carrying something that used to belong to you.",
				"They’re someone you used to know but forgot until now.",
				"The body bursts into butterflies when touched. Their possessions remain intact.",
				"When touched the seed planted in the body’s chest will immediately sprout to full size.",
				"When touched the body will violently expel a pool of acid from all orifices.",
				"The body’s caught in a non-localized time loop. Every 1d6 hours it and its possessions will return to the condition it was found in, and its possessions will return to their positions on the body.",
				"They are still alive but suffering from Cotard delusion."
			]
		}
	]
}