{
	"name": "Aasimar Traits",
	"category": "NPCs",
	"source": "https://www.reddit.com/r/d100/comments/8na5bx/lets_build_aasimar_traits/",
	"data": [
		{
			"name":"Trait",
			"data": [
				"The aasimar causes flowers to bloom when they are near.",
				"Babies stop crying when you get close.",
				"You shine slightly when you are in combat.",
				"People with the same alignment feel good near you.",
				"Peoples allergies clear up near you.",
				"Religious individuals seem drawn to you.",
				"People with dark secrets feel faintly guilty around you.",
				"Lost children often find their way to you.",
				"People with traces of fiend blood start sneezing around you.",
				"Hostile animals always hesitate before striking you.",
				"Impurities in water clear up when you touch it.",
				"When you sing a hymn a faint chorus joins you on the wind.",
				"At sunrise you are surrounded by a brief translucent halo.",
				"Striking you for the first time on a holy day causes a distant rumble of ominous thunder.",
				"People who cheat in your presence get caught more easily.",
				"Young children insist you’re an angel to anyone who’ll listen.",
				"Three random minor miracles occur to other people every time you visit a different community.",
				"Pregnant women you touch are guaranteed a healthy birth without defects.",
				"Blind people can see you, but only as a humanoid shape made of light.",
				"Once a month a near fatal accident will occur in your presence, but everyone involved will be miraculoualy unharmed.",
				"You hear any sincere prayers within 300 feet of you as a gentle whisper.",
				"If you hold an infant there is no force in the multiverse that can harm it while you live.",
				"People tend to choke on their words in your presence if they make an intentionally mean and blasphemous statement or joke – this includes you too.",
				"If you say a prayer over someone’s grave you get a general sense for what plane their soul has departed.",
				"When someone dies in your presence you can actually see their soul departing or being dragged into another plane.",
				"For your shadow, the area is lighter instead of darker.",
				"Celestial runes glow randomly across your body.",
				"You have a peaceful, angelic presence around you, anyone close enough feels at ease and happy.",
				"If you receive chain letters, the people who sent it to you do find true love.",
				"Your footsteps glow slightly behind you.",
				"Dust does not settle on items you have touched or places you have sat.",
				"You have never been bitten by a mosquito or a tick.",
				"You can turn water into wine by breathing over it.",
				"While you sleep a faint sound of music can be heard.",
				"Skin glitters in the dark.",
				"Food tastes better around you.",
				"Desecrated places feel hot under your feet, desecrated items are hot to the touch.",
				"Tavern keepers break open their best stock whenever you enter their establishment.",
				"Your hair appears as if gravity has no effect on it, causing it to wave freely.",
				"You can detect someone’s current alignment by shaking their hand.",
				"People who touch you get a vision of their death (or a possible scenario).",
				"Your irises slightly brighten in color when in a place of worship.",
				"You have no natural body hair.",
				"Rain seems to run off you without actually soaking you or any items you wear.",
				"You have a distinct lock of silver hair on your head.",
				"Your body is minorly reflective.",
				"There is a small bird that always follows you but never approaches, filling the area with distant chirping.",
				"The individual sometimes leaves angelic feathers where they have sat down.",
				"The individual sometimes seems to have a halo above their heads, floating just out of sight.",
				"The individual is abhorrent to all forms of undead.",
				"The individual radiates dim light in a 30 foot radius.",
				"Whenever the individual wears a cape, it will billow majestically as if caught in a wind.",
				"When the aasimar draws her weapon against a wicked foe, it ripples with light as if moments from being set aflame. If the aasimar is a sneaky sort, reflections of a tremendous shadowy thunderhead appear instead. Clashing weapons or shields with an ideological opponent causes the aasimar’s weapons and gear to throw a torrent of sparks.",
				"The aasimar never makes misspellings or simple grammatical mistakes in her writing ever. Her handwriting is swift yet flawless. Even the aasimar’s signature is charismatic.",
				"The aasimar can instinctively tell if a written contract presented to her has deceptive intent. The aasimar notices the overall malice of the author hiding within the handwriting and parchment, but the aasimar must use her own wits to discover the precise catch.",
				"When the aasimar concentrates on a small cloud for a long time, it slowly shapes itself into a rough impression of what the aasimar desires. (Cannot be used for skywriting, the precision is too demanding.)",
				"The aasimar has a knack with much loved heirlooms. The rust on heirloom armor simply flakes off with a little care, grandpa’s broken clock starts running again with a little tinkering, and a child’s ripped stuffed animal practically sews itself together.",
				"If the aasimar takes ten minutes to attune to a location where a worship service was held in the past day and night, she can hear pieces of the worship service that took place. This sense works even when the aasimar is deaf.",
				"The aasimar always includes a little mud or spit in her medical care. The healing doesn’t work as well when the aasimar leaves them out, but the recipes don’t perform when other people try to make them.",
				"His/Her blood gives advantage to driving out demons from possessed people. It gives off a light smoking effect and visible pain by both parties.",
				"They are constantly followed by a pair of mourning doves that occasionally drop berries in front of them.",
				"Any silk cloth they wear for a day makes it nearly impossible to be zombified when used as a burial shroud.",
				"If they sneeze into a pure white handkerchief, they can open it to release a dove, who flies away. Sneezing into a normal handkerchief turns it pure white",
				"If they focus, their ears are able to hear any prayer or cry for help in 100 feet, no matter the sound level or other distraction.",
				"They cry tears of blood, which paradoxically cleans any object used to wipe them away.",
				"On sunny days, they sparkle a little in the light, as if they had been dusted with glitter",
				"People who sleep near the aasimar find that they sleep more restfully and contentedly than they have in a long, long time.",
				"Jokes they tell are just funny. No explaining it. Even the worst, most unfunny joke told by the aasimar is met by a wry chuckle.",
				"If they touch the face of a dying enemy, they get advantage on checks made to convince them to release the information the aasimar seeks.",
				"Once per day, re-roll a failed ranged attack made against an enemy – the projectile has inexplicably bounced off of nearby objects to strike the enemy from behind!",
				"They can attune to an object to make it hum an accompanying melody to a song of their choosing, with a range of 30 feet.",
				"If they trip or stumble, they always find something interesting on the ground in front of their face – a gold coin, a perfectly round stone, a piece of wood that kind of looks like a religious figure.",
				"The aasimar can sleep under blankets comfortably even on the hottest, must humid evenings.",
				"They’ve never lost a thumb war, and can always guess how many fingers you’re hiding behind your back.",
				"People nearby the aasimar can now detect untraceable poisons in their food, with just enough time to react.",
				"Dirt, grime, and sludge is wicked away from their clothing.",
				"Their touch can relieve the elderly of their aches and pains for a week",
				"Criticisms and observations made by the aasimar convince the target of the comments to turn their life around and improve their situations.",
				"Light always reflects in a way that makes them appear as if they are standing in a column of heavenly light, even if the reflections are not logical.",
				"Their teeth are always pearly white, and never fall out. Their baby teeth grow as the rest of them does, and they always fall perfectly into place throughout the growth process.",
				"Dirt and debris seem to be physically incapable of sticking to their body. Coming into contact with anything of the sort results in the offending material sliding right off of them.",
				"When in love, a faintly colored glow hangs in the air around them and gently reaches out towards the object of their affections whenever they are nearby. The exact color of the glow is unique to the individual aasimar.",
				"Whenever they feel indignant, righteous, or justified, the faint pounding of drums can be heard echoing around the minds of all those nearby. The speed and intensity of the drumming increases with the strength of their passion.",
				"When someone of the opposite gender approaches an Aasimar, they get “hot under the collar” and are more likely to do things for them.",
				"Depending on their ancestry, an Aasimar’s general appearance will be vastly different from another. If they’re a descended of a Celestial or other holy being that was related/associated with the sun, then their body might give off a soft glow at night, their iris may look like an actual sun slowly revolving, and/or they have a greater affinity to heat.",
				"An Aasimar may have two vertical lines going down their back near their shoulder blades as if there use to be wings there.",
				"If an Aasimar lays under an old tree that tree will become more vibrant and alive as well as being able to bear fruit after the Aasimar leaves.",
				"Aasimar and Tieflings can sense one another within 200 ft of one another.",
				"The weather always seems to reflect the mood you’re in that day. It’s always sunny when you’re happy; raining when you’re sad; and when you’re angry, there have been horrific storms",
				"The smell of freshly baked bread follows you wherever you go.",
				"Inexplicable memory for things that happened years before their birth.",
				"Innately knows the spell calm emotions and can use it once per day.",
				"Always knows the direction and distance to the nearest place of worship.",
				"They cannot get drunk, and all alcohol tastes vile to them.",
				"Any string instrument they play is instantly tuned to perfection.",
				"When they sing, it sounds like a hundred voices singing in perfect harmony.",
				"You dream of a wonderful, serene place whenever you sleep. If someone sleeps nearby or with you, they join you there.",
				"If you ask a direct and honest question, people are made visibly uncomfortable by telling you a lie or hearing one being told.",
				"Your finger nails mend and clean the things they scratch, can’t break, and are always just the right length for you.",
				"You are not truly an Aasimar, just a common human who has deluded themselves into believing they are. Any magical aasimar traits you use are just you subconsciously casting spells."
			]
		}
	]
}
