{
	"name": "Dragonborn Traits",
	"category": "NPCs",
	"source": "https://www.reddit.com/r/d100/comments/8gq2ge/lets_build_dragonborn_traits/",
	"data": [
		{
			"name":"Trait",
			"data": [
				"The dragonborn is covered in glimmering red scales. They seem to turn a slight orange color in the sunlight.",
				"This dragonborn has several scales missing and a long gash running along his face.",
				"This dragonborn has two long, spined and membranous ears.",
				"This dragonborn has a slightly off-center snout, akin to a poorly-reset broken nose.",
				"This dragonborn has two small bony nubs at their shoulder blades- vestigial wings",
				"This dragonborn has poor control over their breath weapon, and when they are agitated their nostrils and mouth crackle with lightning/exude a green gas/smoke like chimneys drip green acid/breath puffs of frosty white air.",
				"This dragonborn has highly acidic saliva.",
				"This dragonborn has long overly curled horns.",
				"This dragonborn has a heart that glows bright enough to be seen beneath the scales.",
				"This dragonborn has spines that stick out from every joint.",
				"Smoke is always slowly rising from their nose and mouth.",
				"This dragonborn’s scales are prismatic.",
				"This dragonborn has a tiny pair of unusable wings.",
				"This dragonborn has 2 inch retractable nail/talons on their fingers and toes.",
				"This dragonborn has eyes that change color depending on their emotions.",
				"This dragonborn appears to have had their claws torn off, so a leather bound brace of daggers serves as their replacement.",
				"This dragonborn has random different colored scales glistening blue and white.",
				"This dragonborn has a crest of multicolored feathers atop it’s head, resembling a hairdo.",
				"This dragonborn is branded on their forehead with a strange, unknown symbol.",
				"The dragonborn only refers to themselves by a number emblazoned on their gear (necklace, scabbard, belt, etc.).",
				"The dragonborn slurs all their S’s into ‘sh’ sounds.",
				"The dragon’s acid breath clearly went wrong, as the flesh on the right side of his face, from the middle of his neck to the top of his mouth is burned off.",
				"The dragon is missing all of it’s scales, revealing the pale skin beneath. It’s color is only identified by a small patch of scales on it’s cheek.",
				"The dragonborn has one or more hidden paths on their skin where scales never developed.",
				"This dragonborn has traces of another colour (for example, little splotches of black scales on a green dragonborn).",
				"This dragonborn’s voice seems to come from within it, rather than its lips and mouth moving when it talks.",
				"This dragonborn’s eyes gleam red while in combat.",
				"This dragonborn is constantly drawn to live as a dragon and hoard all the loot.. for safe keeping of course.",
				"This dragonborn’s fangs grow in the presents of injured enemies.",
				"The Dragonborn has a cracked or broken snout horn.",
				"(Insert breath weapon) often emerges in either liguid or gaseous form from nostrils when angry, depending on the breath weapon.",
				"This dragonborn has a fake, steel nose horn.",
				"This dragonborn has transluscent or transparent patches of scales.",
				"This dragonborn has a frill running down the chin and neck.",
				"This dragonborn has a frill running up the snout, head, and the back of the neck.",
				"This dragonborn has 3 eyelids: 2 normal ones, and a thin, almost transparent one underneath that moves in a perpendicular direction to the other two.",
				"This dragonborn tends to hiss when speaking.",
				"The Dragonborn has shiny blue scales. The darkness of the color is determined by the temperature.",
				"Their breath weapon is always accompanied by a horrific, sickly sweet stench.",
				"They have two large (possibly colorful) frills instead of horns.",
				"They have albinism, making it hard to tell what exact kind of dragonborn they are.",
				"They have a small patch of scales etched with scratches. It’s become a nervous habit to trace over them or scratch even more.",
				"Their breath weapon is unusually colored (blue fire, red acid, green lightning, etc).",
				"Their horns originate in the back of their head and curl around to face forward.",
				"They have ears. They look elven in nature.",
				"Their eyes have two pupils, with different colored irises.",
				"They have a habit of chewing on gemstones, jewelry, and precious metals.",
				"They randomly switch into speaking Draconic and have to catch themselves.",
				"They have pits in their face instead of an actual nose, similar to a snake’s.",
				"Their scales are a dull, matte color.",
				"They have 5 fingers and 5 toes, as opposed to the standard 3.",
				"They have a long, serpentine tongue.",
				"Their scales are bumpy, thick, and loose on their skin (think a gila monster).",
				"Their scales are sleek and uniform, like a snake.",
				"Their scales are incredibly uneven. Some are huge, others are tiny. This isn’t uncomfortable, just making interesting patterns on their skin.",
				"This dragonborn rambles a lot – Conversations with him tend to DRAG ON.",
				"This dragonborn has a third eye. Doesn’t actually see but can distinguish changing levels of light above them.",
				"Their mouth is brimming with bacteria that can kill in 5-7 days without treatment from a bite.",
				"They have tail spikes like a stegosaurus.",
				"Their scales are a dull faded red color, but glow bright red when the Dragonborn is aroused or in love.",
				"They have the power to make their scales shine with bright neon colors on command.",
				"Their singing voice is the exact opposite tone of their speaking voice (for example, if the Dragonborn is female and has a higher voice, they will sing in a deep bass-baritone). It’s always a beautiful voice regardless, making them better performers.",
				"Their scales are incredibly flexible, allowing the Dragonborn to bend in near impossible positions (think contortionist).",
				"Their hiccups are powerful bursts of freezing air.",
				"His scales shimmer like a rainbow in moonlight.",
				"She has flaps of skin under her armpits, almost like wings but they don’t do anything.",
				"This dragonborn has two frills on top of his head. Keeps him cool in hot temperatures.",
				"This dragonborn has scaly human-like ears. Everyone calls him ‘Ear-boy’.",
				"He stares at you intently as if he can see into your soul. After noticing that he is staring at you thoughts begin to creep into your mind that he is telepathic. You think to yourself that’s ridiculous and he looks disappointed as soon as you do. As soon as you converse dust gets kicked into the air and you notice his nictitating membranes fluttering over his eyes. ‘One more difference between him and you’, you think to yourself.",
				"The Dragonborn’s breath weapon is incredibly uncomfortable, even painful, like puking. A few dry heaves beforehand, with a bit of tears and snot afterwards.",
				"The Dragonborn’s form was not made for the human world. Clawed fingers get in the way of delicate tasks; a head bumped on a low doorway will take some effort in order to pull the horns out. The Dragonborn is resigned to this.",
				"This dragonborn has an above average sized tail to compensate for their vestigial legs.",
				"This dragonborn has shorn horn stubs on the side of their head. They were stolen by alchemists looking for an E.D. cure.",
				"This dragonborn has an odd scale discoloration that looks eerily similar to the crest of a very well known Elven god.",
				"The dragonborn can clean their eyelids with their forked tongue, but only does this as a party trick.",
				"The dragonborn can gallop quadrupedally by using their tail for balance. They are also an effective climber.",
				"The dragonborn has impressive face whiskers like a carp.",
				"The dragonborn hates sweets. He/she is fond of anything that makes a satisfying loud crunch. Bananas are only tolerated with the peel still on.",
				"The dragonborn is patient to a fault and sometimes forgets that children and grandchildren cannot be judged by the actions of their parents.",
				"The dragonborn has a colorful dewlap on their chin and neck.",
				"The dragonborn can move their eyes independently of one another.",
				"Their scales are of a much lighter tone than the skin, making them stand out even more.",
				"They have turned their breath weapon into a party trick so always carry chestnuts to instant roast or room temperature beer to instantly chill.",
				"They are overly formal and insist you call them by their full name and title at all times.",
				"They are covered in a sparkly paint that magically changes colour every few minutes, making it impossible to tell what their natural colour is.",
				"(chromatic) They are not particularly clever and have covered themselves in glitter thinking it will make them look metallic.",
				"They only speak draconic but have a pet talking lizard that sits on their shoulder and translates for them.",
				"They treat all other species like biological specimens that should be studied and are taking extensive notes on their observations.",
				"They are overly vain about their scales and teeth and spend a long time every morning polishing and shining them.",
				"They take great pride in their claws, and have intricate designs painted on them.",
				"They are very elitist in terms of colour and classify other races into the dragon colour categories by hair colour, treating them accordingly.",
				"They have a cold and keep accidentally setting off a mild version of their breath weapon every time they sneeze, which is often.",
				"Whenever they use their breath attack, their eyes shine bright white.",
				"They have weak and useless vestigial wings coming out of their shoulders that they try to keep hidden.",
				"When sleeping, they exhale harmless clouds of smoke from their nostrils.",
				"The dragonborn refuses to eat any meat that isn’t cooked past well done.",
				"They like to cover themselves in mud constantly ‘to fight parasites’.",
				"The dragonborn has a bifurcated nose horn.",
				"The dragonborn has tiny useless T-Rex arms on their shoulder blades.",
				"The dragonborn has dry patches of grey scales that occasionally sluff off."
			]
		}
	]
}
