{
	"name": "Items in a Hag's Lair",
	"category": "Items",
	"source": "https://www.reddit.com/r/d100/comments/8st202/lets_build_items_in_a_hags_lair/",
	"data": [
		{
			"name":"You find",
			"data": [
				"A massive bubbling cauldron. Inside it is a disgusting mixture of god knows what.",
				"A small collection of caged rats.",
				"A overflowing jar of teeth.",
				"Eyes of various creatures.",
				"An active mirror of life trapping.",
				"Dust of sneezing and choking.",
				"A small child, apparently unharmed.",
				"A drum, covered in a mysterious skin.",
				"Paintings and sculptures of prominent townspeople.",
				"A deep water well built into the room.",
				"An Ogre or Giants severed toe.",
				"The still beating heart of some unknown humanoid.",
				"A talking skull.",
				"A set of giant steel manacles that look like they could hold a giant.",
				"A petrified gazer.",
				"Seven jars filled with blood. One of them has recently been emptied.",
				"A plant pot containing a Shrieker that screams when you touch it.",
				"A crate filled with rotted children’s clothing and old toys.",
				"Six inches of orange tinted water on the floor.",
				"A ball of snot-like sludge hanging from the ceiling.",
				"A chest with an ungodly amount of sweets.",
				"A book full of delicately preserved wings from butterflies and other small insects.",
				"A cyclops’ eye that has a bite taken out of it.",
				"A back scratcher made from a severed bony hand.",
				"A pin board of insects found in the swamp or Underdark, like strange beetles.",
				"The preserved, leathery head of a dwarf.",
				"A strange jar of coloured jelly. Upon closer inspection, you find it is a tiny-sized ooze or oblex in a jar.",
				"An eyeball in a tube of yellow viscous fluid, sealed with a cork. The eye moves and looks around.",
				"An old tarnished silver bell. Ringing it casts Toll The Dead once a day.",
				"A copper ring in the dirt that has a rat’s chewing marks in it.",
				"A jar with an overweight toad crammed into it, that sings when lifted.",
				"Half of a beehive covered in Infernal writing. When the honeycomb is broken, an Imp is summoned.",
				"A scruffy, scarred pigeon that nests in the rafters. Its regular sounds are replaced by snippets of the hags voice yelling insults.",
				"An Annis Hag has a huge rusty nail, the length of a forearm. The person holding it feels paranoid and cruel, but gains advantage on Perception checks.",
				"A skull of any local beast, a candle melting upon it. When the candle is snuffed out, the eye sockets glow red. It then materializes the rest of the body as a specter, until the eyes are gouged out. The candle will then re-ignite. While a specter, the creature is a neutral undead, and simply watches and wanders about, being all spooky. Works best as a small creature, like a cat or raven.",
				"An unusually large slug in a cage that produces extremely sticky ooze.",
				"A small garden growing a bunch of weird herbs.",
				"A large alembic which is currently distilling a medium ochre jelly.",
				"A display case of flattened beast ears arranged in such a way that a distant observer may mistake it for a butterfly display.",
				"A dresser whose drawers are overflowing with loose hairs. A player who searches through the hair will find a vial of antitoxin.",
				"A mannequin wearing a crusty set of fine clothes which appear to have been soaked entirely in blood which has now dried completely. There are no visible stains on the mannequin.",
				"A bird’s cage containing a wererat.",
				"Bones from humanoid hands which have been fastened together into a headdress.",
				"A shattered mirror. The mirror shows a decaying and zombie-like version of the players, but a beautified version of the hag.",
				"Chicken feathers sticking out of the ground in bizarre patterns.",
				"A wooden chest with a beating heart in it.",
				"An apple that reveals itself to be rotten if eaten.",
				"A dead bird tied to the ceiling.",
				"Glass orb containing the souls of screaming children.",
				"A suit of armor that was once a man.",
				"People converted into anthropomorphic kelp.",
				"Tentacle from a vampire squid.",
				"Eye of newt jar. Half full.",
				"Dried batwing.",
				"A cursed gold chain necklace. Once put on it cannot be removed. When the wearer speaks a lie a link is magically removed from the chain, the link clatters loudly to the ground. Lie enough and it begins to choke the wearer.",
				"A journal by a young lass from a hundred years ago. The entries are positive, optimistic, romantic. Somewhere in the her late teens she falls in love for a fellow and at the same time she’s visited by nightmares, headaches and visions. Strangely the visions darkly warn her that her lover is dangerous, something she refuses to believe even when other things she sees in them come to pass. She writes that she plans to run away with him before the journal abruptly ends. A knowledge check might reveal that the symptoms she describes are signs of a changeling coming into her power on the path to becoming a hag.",
				"A freshly baked pie, its crust perfectly buttered.",
				"A bouquet of flowers, suspended upside down to dry, smelling pleasantly of notes of lavender and rose buds.",
				"A jar of candy wrapped in brightly colored wax paper.",
				"A cracked hand mirror, which always shows a shadowy figure to be standing behind the one looking in it. Sometimes, the figure moves.",
				"A child’s patchwork doll, missing a button eye and stained in blood.",
				"A starved and maimed goblin in an iron cage. He rattles the bars rather than react to the visitors. It is clear it went mad long ago.",
				"An immortal monkey that looks normal but quickly reveals his undead nature in the moonlight.",
				"A massive tapestry hung from the wall. Strange symbols and stranger images fill every space, chaotically strewn about the threadwork with no apparent pattern. No centralized theme or focus can be made out, but the likeliness of several important figures and deities can be made out amongst alien creatures and other, unknown people. The tapestry is unfinished on one side, making it obvious that the project is still a work in progress.",
				"An almost person-sized hourglass dangling from a rope tied to the ceiling. In place of sand, tiny teeth of all shapes and kinds flow between the two bulbs, each one glowing with a faint red light. The flow of the device switches directions at random times for nobvisible reason, with no bulb ever holding all the teeth.",
				"A tattered ball gown, it’s faded green color and shredded edges indicating its impressive age. It drifts gently through the air as if carried by an invisible wind, moving haphazardly but never touching the room. Attempts to grab the dress automatically fail without the use of magic, the dress always fluttering just out of reach. Once grabbed, the dress stops permanently stops moving and shows no sign of its previously magical nature.",
				"A heavy old tome with yellowed pages and a blank cover. The book does not match the design of the surrounding books, and has a somewhat homemade feel to it. Nearly all the pages are filled with impressively lifelike sketches of an assortment of common folk, each with a smile on their face. All the drawings seem to be situated in the same village, with a single family and house appearing more frequently than any of the others. The members of that family each bear a slight resemblance to the hag.",
				"A severed head taken from a rival long ago. The neck seeps blood from its wound, and constantly softly whispers nigh incoherently, saying all that the witch had learnt from her long-lived life, tales of old, hidden secrets and recipes long forgotten, to name a few.",
				"An aged drawing of the current PCs that entered the lair.",
				"A goblin in a cage that speaks common eloquently.",
				"A large firefly in a cage that will listen to commands. Glows red with the effect of Light.",
				"A life size “voodoo” fetish that looks eerily like one of the PCs.",
				"A skeleton on an eloborate wooden throne that will suddenly scream and crumple if a PC approaches it, laying a curse on that PC.",
				"A neatly organized tackle box containing a collection of human fingers and toes.",
				"A pair of slippers that automatically adjusts to be as comfortable as possible for their wearer.",
				"A piece of chalk which when used to write a persons full name causes that person to shiver. It ceases to work once all the chalk is exhausted.",
				"A fancy paper hat which causes the wearer to attract bees, wasps, hornets, and bumblebees, which remain non-hostile until the wearer removed the hat.",
				"A glass bottle filled with a foul tasting dark blue liquid. If consumed the liquid convinces the person who consumed it that they are going to die as a result.",
				"A large white table cloth that can be used to set a table. When its command word is spoken it cleans itself of all stains and food, then folds itself into a neat triangle.",
				"A decorative wine glass that poisons any liquid inside of it with cyanide when a command word is spoken (cheers).",
				"A stack of love letters written in Abyssal penned by a demon who apparently was smitten by the sight of the hag during a planar jaunt. Appears that the interest was unrequited.",
				"A basin of murky water that is constantly scrying a young girl, possibly a changeling. Vials of three colors with a dropper sit on the rim of the basin. Dropping the blue liquid in the basin visits the girl with good luck, red delivers bad luck to a someone near her, but the black inky liquid has no apparent effect.",
				"An origami figure of a stork. Has a faint conjuration aura to it.",
				"A broken arrow atop a bottle of rain. Holding the bottle allows you to walk on water. Holding the arrow turns your hand to steel (you do twice the damage of an unarmed strike, but take disadvantage on tasks requiring two hands. You can pry the arrow from your hand—but careful if you take too long both your hands will turn to steel).",
				"A cage with the skeletal remains of two small humanoids, the hand of one clutching the hand of the other.",
				"Erikkson the Philosophical Scarecrow. This scarecrow sits motionless in a part of the room, but will animate when he deems it necessary. He loves to eat straw (and flesh), and loves to tell riddles. He especially loves it when his riddles win him the flesh of others. But he doesnt cheat. He is a genuine and fair scarecrow. He wont eat any more than has been agreed on. If he says he will play riddles for a PC’s hand, then he will keep his word. He also LOVES to talk about the metaphysical nature of the world.",
				"Two voodoo esque dolls of other hags, with faint magic within, from when she tried to create a coven with the souls of dead hags.",
				"A cauldron that can be used as a ritual focus. When used in ritual magic, the DC goes up 1 per person (limited to 3).",
				"Corrupted rings of resistance (which are cursed to grant vulnerability instead).",
				"A black cat sits curled up on a chair. When you approach, he remains unmoved, and trying to interact with him you find him immovable. If you attempt to sit on him/in the chair, you are cursed by the chair as the cat appears upon your lap and is the same as an immovable rod place on your knees.",
				"There is an alchemy desk with the accouterments you would expect. Eyes in jars, fingers in candlestick holders, with thin wicks coming out of the tips, animal parts, and grisly looking things you don’t think about too much. Despite everything, you can’t but find yourself feeling extremely hungry while examining it.",
				"The hag’s kitchen is a marvel of inventive interior design, with hands that stick out of the walls, as though their owners were forced into the stone itself. The hands hold cups, cutlery, a set of keys, a hat, a dark cloak and hanging vegetables.",
				"A severed foot with many different types of moss and fungi growing on it.",
				"A stomach and intestines hung on the wall, with a mouth connected to one end, and the other end leading into a barrel (I don’t recommend opening the barrel). It must be fed regularly or it will jump off the wall and begin eating everything.",
				"An undead toad in a glass jar with a miniature Sphere of Annihilation in its mouth.",
				"The shadow of a rat on the floor, which moves as a normal rat would. However, there is no rat, not even an invisible one.",
				"A mirror that shows a clown (or some scary thing) standing behind you. It isn’t really there, and it doesn’t seem to interact with you, but is very creepy.",
				"A fist-sized gemstone to which the astral form of a trickster being is bound. Touching it allows you to see and communicate with the being. It begs that you reunite it with it’s body.",
				"A taxidermy beholder being used as a chandelier.",
				"A group of small children trapped in a cage."
			]
		}
	]
}
